{
    "vulture": "Vultures are large birds of prey with bald heads and sharp beaks.",
    "stingray": "Stingrays are typically characterized by their flat, broad body, long tail with a sharp stinger, and a mouth located on the underside of their body.",
    "rifle": "A rifle is a long, slender firearm with a barrel and a stock, typically used for hunting or military purposes.",
    "automated teller machine": "An automated teller machine is a self-service device that allows customers to perform various banking transactions, such as withdrawing cash, depositing funds, and checking account balances, through a computer interface and a network connection.",
    "southern black widow": "The southern black widow spider has a shiny black body with a red hourglass shape on its underside.",
    "magpie": "Magpies are known for their black and white feathers, which create a striking contrast against their surroundings.",
    "jellyfish": "Jellyfish are typically characterized by their bell-shaped body, trailing tentacles, and a distinctive umbrella-like canopy.",
    "vestment": "A vestment is a type of garment that is typically worn over other clothing and is often adorned with intricate designs, patterns, and embellishments.",
    "indigo bunting": "The indigo bunting is a small songbird with a bright blue plumage on its head and wings, and a reddish-brown breast.",
    "guacamole": "Guacamole is a green dip made from mashed avocados, lime juice, onions, tomatoes, and spices.",
    "pill bottle": "A pill bottle typically has a cylindrical shape with a rounded top and a flat bottom, and it is usually made of clear glass or plastic with a white or light-colored label.",
    "radiator": "A radiator is a long, flat, metal panel with a series of fins or tubes running along its length, designed to emit heat from a fluid running through it.",
    "purse": "A purse is a small bag that is typically carried by women and is used to store personal belongings.",
    "rocking chair": "A rocking chair typically has a curved, contoured back and a comfortable, cushioned seat, often with a wide armrest on one or both sides.",
    "Leonberger": "Leonbergers are large, muscular dogs with a distinctive mane of long, silky hair that falls over their forehead.",
    "tusker": "A tusker is a large, gray elephant with long, curved tusks and a distinctive hump on its forehead.",
    "gar fish": "Gar fish are known for their long, slender bodies and elongated snouts.",
    "burrito": "A burrito is a type of Mexican food that is typically made with a flour tortilla filled with various ingredients such as rice, beans, meat, cheese, and vegetables, and then rolled up and sometimes grilled or steamed.",
    "electric guitar": "An electric guitar typically has a solid body made of wood, a neck with frets, and pickups that convert the vibration of the strings into an electrical signal.",
    "Komondor": "The Komondor is a large, muscular dog with a distinctive long, corded coat that is typically white in color.",
    "syringe": "A syringe is a medical device that consists of a hollow cylindrical tube with a plunger and a needle attached to the end.",
    "European garden spider": "The European garden spider has a distinctive yellow and black striped pattern on its body.",
    "cannon": "A cannon is a large, cylindrical weapon with a smooth, metallic surface and a flared muzzle through which the projectile is fired.",
    "gas mask or respirator": "A gas mask or respirator is a protective device that covers the face and filters out harmful substances from the air.",
    "bullock cart": "A bullock cart is a traditional mode of transportation that is characterized by its simple and sturdy design, with a flat bed or platform that is pulled by one or more large, strong animals such as oxen or buffalo.",
    "medicine cabinet": "A medicine cabinet typically has a mirrored door and shelves for storing medications and other items.",
    "French Bulldog": "A French Bulldog is a small, stocky dog with a distinctive short muzzle, large expressive eyes, and a wrinkled forehead.",
    "lion": "A lion is a large, majestic feline with a distinctive mane, a powerful build, and a coat of fur that can range in color from light brown to dark brown or black.",
    "spaghetti squash": "Spaghetti squash has a distinctive long, cylindrical shape with a mildly sweet, nutty flavor and a tender, buttery texture when cooked.",
    "grey wolf": "A grey wolf is a large, powerful animal with a thick, bushy tail, erect ears, and a distinctive black-tipped tail.",
    "red fox": "A red fox is a small, agile mammal with a distinctive red fur, a bushy tail, and large, pointed ears.",
    "eft": "The left side of a person's body is typically characterized by the dominant hand, the heart, and the lungs.",
    "slug": "Slugs are small, slimy, and have a smooth, elongated body with a distinctive head and tail.",
    "cheeseburger": "A cheeseburger typically consists of a cooked ground beef patty placed between two halves of a bun, with melted cheese on top.",
    "combination lock": "A combination lock typically consists of a circular dial with multiple numbered slots and a keyhole for inserting a key.",
    "television": "A television is a flat-screen device that displays images and videos using a grid of tiny light-emitting diodes.",
    "moving van": "A moving van is a large vehicle with a spacious interior and a ramp at the back for loading and unloading furniture and other items.",
    "Border Collie": "Border Collies are known for their distinctive black and white fur, piercing blue eyes, and agile, athletic build.",
    "pedestal": "A pedestal is a raised platform that typically has a flat surface on top and is often used to display or support objects such as statues or vases.",
    "product packet / packaging": "The product packet had a brightly colored label with bold white lettering.",
    "ruler measuring stick": "A ruler measuring stick is typically a long, narrow, and rectangular object with a series of markings or measurements along its length.",
    "warthog": "Warthogs are large, gray animals with a distinctive wart-like protuberances on their heads and a tuft of hair at the end of their tails.",
    "Black and Tan Coonhound": "Black and Tan Coonhounds are known for their distinctive appearance, which includes a short, smooth coat with a black and tan color pattern, expressive eyes, and long, floppy ears.",
    "candy store": "A candy store typically has a colorful and vibrant display of various types of candy, with brightly colored wrappers and enticing packaging.",
    "marimba": "A marimba is a musical instrument that has a set of wooden bars of different lengths that are mounted over a resonator, and it is played by striking the bars with mallets.",
    "scorpion": "Scorpions are known for their distinctive long, thin tails and large, sharp claws.",
    "wallaby": "A wallaby is a small, herbivorous mammal with a compact body, short legs, and a bushy tail.",
    "hot dog": "A hot dog is a type of sausage that is typically served in a sliced bun and garnished with various toppings such as mustard, ketchup, onions, and relish.",
    "plate rack": "A plate rack is a storage solution that typically consists of a series of shelves or pegs for holding plates, often with a decorative design or aesthetic.",
    "sliding door": "A sliding door is a type of door that slides open horizontally, typically with a track system that allows it to move smoothly along a floor-mounted rail.",
    "suspension bridge": "A suspension bridge is characterized by its long, slender deck suspended from cables that are anchored to towers on either end of the bridge.",
    "harmonica": "A harmonica is a small, handheld musical instrument with a mouthpiece, a set of reeds, and a cover plate, typically made of metal or plastic.",
    "metal nail": "A metal nail typically has a cylindrical shape with a slightly tapered end and a smooth, shiny surface.",
    "oil filter": "An oil filter is a cylindrical component with a paper or synthetic filter medium that is designed to remove contaminants from engine oil.",
    "dome": "A dome is a curved architectural structure that resembles the hollowed-out interior of a sphere, and is typically characterized by its smooth, rounded surface and central opening or apex.",
    "limousine": "A limousine is a long, luxurious car with a partition separating the driver from the rear passenger compartment.",
    "little blue heron": "The little blue heron is a small wading bird with a long, sharp beak and a blue-gray body.",
    "crane bird": "Crane birds are typically characterized by their long legs, long neck, and a distinctive beak that is adapted for wading in shallow water.",
    "electrical switch": "An electrical switch is a device that is used to control the flow of electricity in a circuit, and it typically has a set of terminals for connecting wires and a lever or button that can be flipped to turn the switch on or off.",
    "forklift": "A forklift is a large, industrial vehicle with a long forked platform on the front for lifting and moving heavy objects.",
    "tea cup": "A tea cup typically has a handle, a spout, and a body with a bowl-shaped base.",
    "entertainment center": "An entertainment center is typically a large, sturdy piece of furniture that serves as a focal point in a living room or family room. It often features a TV stand or cabinet for storing and displaying electronic devices, as well as shelves or cabinets for storing DVDs, Blu-rays, and other media. Some entertainment centers also include a sound system or speakers, and may have additional storage options such as drawers or doors. The design of an entertainment center can vary widely, from modern and minimalist to traditional and ornate, depending on the style of the room and the personal preferences of the homeowner.",
    "wardrobe": "A wardrobe is a tall, freestanding cabinet with a door and shelves for storing clothing and other items.",
    "dowitcher": "A dowitcher is a small, brown and white bird with a short tail and long, thin legs.",
    "bobsleigh": "A bobsleigh is a small, sleek vehicle with a streamlined shape and a pointed front, designed for high-speed travel on a track.",
    "reflex camera": "A reflex camera is a type of camera that features a mirror and a prism, which allows the photographer to see the image that will be captured through the lens.",
    "toucan": "Toucans are known for their large, colorful beaks and their distinctive, eye-catching plumage.",
    "construction crane": "A construction crane is a large, tall machine with a long arm and a bucket or other attachment at the end, used for lifting and moving heavy materials and objects at construction sites.",
    "sink": "A sink is a basin-shaped fixture that is typically installed in a bathroom or kitchen for washing hands, dishes, or other items.",
    "bee eater": "Bee eaters are small, colorful birds with long, slender bodies and distinctive plumage that includes iridescent greens, blues, and yellows.",
    "red wine": "A glass of red wine typically has a deep red or maroon color with a hint of purple at the rim, and may have a slightly opaque appearance due to the presence of suspended particles.",
    "violin": "A violin is a musical instrument with a hollow wooden body, a neck, a fingerboard, and four strings.",
    "cleaver": "A cleaver is a large, heavy knife with a thick blade and a rectangular cross-section, typically used for chopping meat and bone.",
    "shovel": "A shovel is a tool with a long handle and a flat blade, typically used for digging or moving materials.",
    "barbell": "A barbell is a piece of exercise equipment that consists of a long, straight bar with weights on each end.",
    "Old English Sheepdog": "Old English Sheepdogs are known for their shaggy, thick coats and distinctive, expressive faces.",
    "acoustic guitar": "An acoustic guitar is a musical instrument that has a hollow body, a sound hole, and a neck with frets.",
    "poncho": "A poncho is a large, loose garment with a hood that is typically worn over other clothing.",
    "Bluetick Coonhound": "Bluetick Coonhounds are a breed of dog known for their distinctive blue-gray coat, floppy ears, and expressive eyes.",
    "altar": "An altar is a raised platform or structure, typically found in religious or spiritual settings, and is often adorned with various decorative elements, such as candles, flowers, or religious symbols.",
    "goose": "A goose is a large, gray-brown bird with a distinctive black head, a white collar, and a long, curved neck.",
    "hook": "A hook is a curved, pointed object that is used for catching or securing something.",
    "boa constrictor": "Boa constrictors are large, heavy-bodied snakes with a distinctive pattern of brown or reddish blotches separated by lighter-colored lines on their body.",
    "lipstick": "Lipstick is a cosmetic that comes in a small tube and is applied to the lips to give them a pink or red color.",
    "slip-on shoe": "A slip-on shoe typically has a flat sole, a round toe, and a simple, slip-on design that allows the foot to slide easily into the shoe.",
    "ladle": "A ladle is a long-handled tool with a deep, concave bowl used for scooping and pouring liquids or semi-liquids.",
    "traffic or street sign": "A traffic or street sign typically features a rectangular shape with a white background and black text, often displaying information such as street names, directions, or regulations.",
    "breakwater": "A breakwater is a long, narrow structure typically made of rocks, concrete, or other materials, designed to protect a harbor or coastline from the force of waves.",
    "ping-pong ball": "A ping-pong ball is small, round, and has a uniform, bright color.",
    "tree frog": "Tree frogs are small, slender amphibians with long legs and a smooth, moist skin that helps them blend in with their surroundings.",
    "stone wall": "A stone wall is typically made of rough, uneven stones that are stacked on top of each other to create a sturdy and durable structure.",
    "American lobster": "American lobsters are known for their bright red color, large claws, and distinctive spiny body.",
    "viaduct": "A viaduct is a large, elevated structure that is typically made of stone or concrete and has multiple arches or piers supporting its deck.",
    "red admiral butterfly": "The red admiral butterfly has a distinctive black and orange wing pattern.",
    "jackfruit": "Jackfruit is a large, green fruit with a rough, spiky skin and a dense, fibrous interior.",
    "Dalmatian": "Dalmatians are a breed of dog known for their distinctive black or liver-colored spots on a white background.",
    "Great Dane": "Great Danes are known for their large size, long legs, and sleek, muscular build.",
    "fire truck": "A fire truck is a large vehicle with a bright red color, a ladder on top, and flashing lights.",
    "movie theater": "A movie theater typically features a large, dark auditorium with comfortable seating, a large screen, and surround sound audio system.",
    "meatloaf": "A meatloaf is a type of food that is typically made from ground meat, breadcrumbs, eggs, and various seasonings, and is often formed into a loaf shape before being baked.",
    "bustard": "Bustards are large, long-legged birds with a distinctive upright stance and a long, curved beak.",
    "ram (adult male sheep)": "A ram is an adult male sheep with large, curved horns and a thick, woolly coat.",
    "odometer": "An odometer is a device used to measure the distance traveled by a vehicle, typically displayed on a dial or digital screen with numerical readout.",
    "kingsnake": "Kingsnakes are large, non-venomous snakes with a distinctive pattern of black and yellow or orange and red rings on their bodies.",
    "Miniature Poodle": "Miniature Poodles are a small breed of dog known for their distinctive black or brown fur, expressive eyes, and erect ears.",
    "monitor": "A monitor is a display device that is used to show images and text on a computer screen.",
    "race car": "A race car is a high-performance vehicle that is designed for speed and agility on the racetrack, featuring a sleek and aerodynamic body, powerful engines, and advanced suspension systems.",
    "bucket": "A bucket is a cylindrical container with a flat base and a handle.",
    "website": "The website has a clean and modern design, with a prominent navigation menu and large, high-quality images.",
    "plant pot": "A plant pot is typically a round, flat-bottomed container made of ceramic, plastic, or metal, with a drainage hole in the bottom and a handle for easy transport.",
    "matchstick": "A matchstick is a small, thin, cylindrical object with a rough, textured surface and a small, flat head on one end.",
    "popsicle": "A popsicle is a frozen treat that is typically cylindrical in shape and has a smooth, slightly textured surface.",
    "prairie grouse": "Prairie grouse are known for their distinctive appearance, which includes a small, stocky body, long legs, and a short tail. They have a mottled brown and black plumage that provides excellent camouflage in their grassland habitat.",
    "slot machine": "A slot machine typically has a set of spinning reels with different symbols on them, a display screen that shows the current game state, and buttons or a touchscreen for placing bets and initiating spins.",
    "gyromitra": "Gyromitra is a type of mushroom that has a distinctive brain-like shape and a reddish-brown color.",
    "canoe": "A canoe is a small, lightweight watercraft that is typically made of wood or fiberglass and has a narrow, elongated hull with a shallow draft and a cockpit for the paddler.",
    "paintbrush": "A paintbrush is a tool used for applying paint to a surface, typically consisting of a handle and a bristle head.",
    "ring-necked snake": "A ring-necked snake has a distinctive black ring around its neck, which is separated from its body by a white or yellowish patch.",
    "Whippet": "Whippets are a breed of dog known for their slender, athletic build and sleek, short-haired coat.",
    "house finch": "The house finch is a small, colorful bird with a streaked brown body, a conical-shaped beak, and a short, stubby tail.",
    "bagel": "A bagel is a type of bread that is typically round in shape, with a hole in the center, and has a dense, chewy texture.",
    "bubble": "A bubble is a small, spherical, and usually transparent object that is filled with air or gas and has a thin, shiny surface.",
    "polar bear": "A polar bear is a large carnivorous mammal with a thick layer of blubber, a dense double layer of fur, and a distinctive white coat.",
    "combine harvester": "A combine harvester is a large, heavy-duty machine with a long, flat platform that is used to harvest crops.",
    "barn": "A barn typically has a rustic and sturdy appearance, with a wooden exterior, a pitched roof, and a large door for storing hay and farm equipment.",
    "alligator lizard": "Alligator lizards are characterized by their long, slender bodies, powerful legs, and broad, flat tails.",
    "Polaroid camera": "A Polaroid camera is a type of instant camera that produces square-shaped photos with a white border.",
    "isopod": "Isopods are small, flat, and have a segmented body with seven pairs of legs.",
    "infant bed": "An infant bed typically has a small, compact design with a low height and railings on the sides to provide safety and security for the baby.",
    "lakeshore": "A lakeshore typically features a shoreline with calm water, sandy or rocky beaches, and often includes vegetation such as grasses, shrubs, and trees.",
    "muzzle": "A muzzle is the front part of an animal's head that surrounds the snout and typically has a prominent nose and mouth.",
    "scoreboard": "A scoreboard is a large, rectangular board that displays the score of a game or match.",
    "split-rail fence": "A split-rail fence is a type of fence that is made by weaving together wooden rails that have been split lengthwise.",
    "Newfoundland dog": "Newfoundland dogs are known for their large size, thick double coat, and distinctive droopy ears.",
    "baby bib": "A baby bib is a piece of clothing that is typically worn by infants to protect their clothes from spills and stains. It is usually made of soft, absorbent material and has a large, round shape that covers the front of the baby's body. Baby bibs often have a pocket or a snap closure to make it easy to clean and can come in a variety of colors, patterns, and designs.",
    "swing": "A swing is a playground structure that consists of a seating area, usually a set of swings, that is suspended from a central frame by chains or ropes.",
    "quilt": "A quilt is a textile that is typically made by sewing together layers of fabric, batting, and backing, and is often characterized by its intricate patterns and vibrant colors.",
    "bald eagle": "A bald eagle is a large bird of prey with a distinctive white head and tail, and a body that is brown and black.",
    "cliff": "A cliff is a tall, steep, and often rocky formation that overlooks a body of water or a valley.",
    "wombat": "Wombats are small, stocky mammals with short, stubby tails and thick, furry coats.",
    "power drill": "A power drill is a handheld tool that consists of a motorized drilling mechanism and a chuck for holding drill bits.",
    "sleeping bag": "A sleeping bag is a type of bag that is designed to be used as a portable and comfortable resting place for camping and outdoor activities.",
    "sailboat": "A sailboat typically has a hull, a mast, sails, a rudder, and a cabin.",
    "wine bottle": "A wine bottle typically has a narrow neck, a wide body, and a rounded bottom, with a label on the front and a cork or cork-like closure on the top.",
    "tench": "A tench is a freshwater fish with a long, slender body, a large mouth, and a distinctive black stripe running along its side.",
    "ice cream": "Ice cream is a sweet, cold dessert that is typically made from milk, cream, and sugar, and is often flavored with various ingredients such as fruit, chocolate, or nuts.",
    "white stork": "A white stork is a large, long-legged wading bird with a long, pointed beak and a distinctive S-shaped neck.",
    "shopping cart": "A shopping cart is a small, wheeled vehicle with a basket or compartment for holding items, typically found in grocery stores or retail establishments.",
    "Gila monster": "The Gila monster is a large, slender lizard with a distinctive black and pink skin pattern.",
    "croquet ball": "A croquet ball is typically small, round, and colorful, with a smooth surface and a hole in the center.",
    "white-headed capuchin": "White-headed capuchins are small monkeys with white fur on their heads and a brown body.",
    "espresso": "Espresso is a type of coffee that is characterized by its rich, dark color and a thick, creamy texture.",
    "one-piece bathing suit": "A one-piece bathing suit typically features a close-fitting design with a high-waisted bottom and a modest, often ruched or gathered, top that covers the bust.",
    "damselfly": "Damselflies are small, delicate insects with long, slender bodies and large, iridescent wings that are often colored with blue, green, and black hues.",
    "snowplow": "A snowplow is a large, heavy-duty vehicle with a wide, flat blade in front to clear snow from roads and driveways.",
    "crossword": "A crossword is a word puzzle that typically consists of a grid of squares with clues written horizontally and vertically, and the corresponding answers filled in by the solver.",
    "banjo": "A banjo is a stringed musical instrument that typically has a round, hoop-shaped body with a membrane stretched across it, a neck with frets, and a tailpiece that anchors the strings.",
    "snoek fish": "Snoek fish are typically long and slender, with a streamlined body and a forked tail.",
    "cauldron": "A cauldron is a large, deep, round-bottomed pot that is typically used for cooking or boiling.",
    "space shuttle": "A space shuttle is a large, winged vehicle with a pointed nose and a delta-shaped wing configuration.",
    "clogs": "Clogs are a type of footwear that are typically made of wood and have a distinctive, chunky appearance.",
    "broom": "A broom typically has a long handle and a head made of stiff bristles, which is used for sweeping and cleaning.",
    "Treeing Walker Coonhound": "A Treeing Walker Coonhound is a breed of dog known for its agility, speed, and distinctive appearance, which includes a lean, muscular build, large floppy ears, and a smooth, short coat that can be either red or white with black markings.",
    "spindle": "A spindle is a cylindrical object with a central hole that is used for spinning fibers or threads.",
    "Chihuahua": "Chihuahuas are a small breed of dog known for their big ears, expressive eyes, and distinctive mustache.",
    "gymnastic horizontal bar": "A gymnastic horizontal bar is typically made of metal and has a flat, horizontal surface with grip handles on either end for the gymnast to hold onto while performing various tricks and maneuvers.",
    "Rhodesian Ridgeback": "The Rhodesian Ridgeback is a large, muscular dog with a short, dense coat and a distinctive ridge of hair running down its back.",
    "lifeboat": "A lifeboat is typically a small, sturdy vessel designed for use in emergency situations, with a brightly colored hull and a distinctive shape to make it easily visible on the water.",
    "washing machine": "A washing machine is a large, white appliance with a door for loading and unloading clothes, a control panel with buttons for selecting different wash cycles, and a drum where the clothes are agitated and spun during the wash cycle.",
    "echidna": "An echidna is a small, spiny mammal with a distinctive snout and a coat of short, coarse hairs.",
    "Wire Fox Terrier": "Wire Fox Terriers are a small, agile breed of dog with a distinctive wiry coat, expressive eyes, and a confident, alert expression.",
    "meerkat": "Meerkats are small, slender mammals with long tails, large ears, and expressive eyes.",
    "sulphur-crested cockatoo": "A sulphur-crested cockatoo is a large, white bird with a distinctive yellow crest on its head.",
    "Granny Smith apple": "Granny Smith apples are known for their bright green color, firm texture, and distinctive tart flavor.",
    "Norwich Terrier": "The Norwich Terrier is a small, sturdy dog with a distinctive mustache and beard, a wiry coat, and a confident, alert expression.",
    "dock": "A dock typically features a long, flat surface that extends out over the water, with a railing or barrier to prevent people from falling in.",
    "Briard": "The Briard is a large, muscular dog with a distinctive shaggy coat and a gentle expression.",
    "piggy bank": "A piggy bank is a small, plastic or ceramic container that is designed to resemble a pig, and is typically used to hold coins or small bills.",
    "marmoset": "Marmosets are small, agile monkeys with long, bushy tails and large, expressive eyes.",
    "tripod": "A tripod is a three-legged stand that is typically used to hold a camera or other equipment steady.",
    "cradle": "A cradle is a small, typically rocking bed designed for infants and young children.",
    "hay": "Hay is a type of fodder made from dried grasses and legumes, and it typically has a golden or greenish color, with a texture that can range from fine and powdery to coarse and stringy.",
    "Pekingese": "The Pekingese is a small, long-haired dog with a distinctive topknot on its head and a long, flowing tail.",
    "American alligator": "An American alligator has a long, broad snout with a rounded tip, a tough, armored body covered in rough, scaly skin, and four short, powerful legs.",
    "bikini": "A bikini is a type of swimwear that typically consists of two separate pieces, a top and a bottom, that are designed to be worn together to cover the wearer's torso and lower regions while providing minimal coverage and a revealing appearance.",
    "flagpole": "A flagpole is typically tall and slender, with a smooth surface that tapers towards the top, where a flag is usually attached.",
    "stinkhorn mushroom": "Stinkhorn mushrooms are characterized by their long, slender stem and large, fan-shaped cap that is often brown or black in color.",
    "castle": "A castle typically features a large, imposing structure with tall towers, crenelated walls, and a moat or other defensive features.",
    "swim trunks / shorts": "Swim trunks are typically made of lightweight, quick-drying fabric and feature a drawstring waist for a secure fit.",
    "window screen": "A window screen is a mesh-like structure that is typically made of metal or plastic and is designed to cover the opening of a window while still allowing air to circulate.",
    "Christmas stocking": "A Christmas stocking typically has a red or green color, is filled with small gifts, and often features a white or gold trim.",
    "leafhopper": "Leafhoppers are small, slender insects with long, thin wings and a distinctive wedge-shaped body.",
    "sea lion": "Sea lions are large marine mammals with a distinctive appearance, featuring a thick, furry coat, a broad chest, and a powerful build.",
    "rotisserie": "A rotisserie is a kitchen appliance that features a spit or rotating rod for cooking meat or poultry.",
    "Mexican hairless dog (xoloitzcuintli)": "The Mexican hairless dog, also known as the xoloitzcuintli, is a small and slender breed with a smooth, hairless body and large, expressive eyes.",
    "cricket insect": "Cricket insects are typically small, with long antennae and legs, and a distinctive chirping sound that they produce.",
    "picket fence": "A picket fence is a type of fence that is characterized by its evenly spaced, vertical boards.",
    "bra": "A bra is a piece of undergarment that is typically worn by women to support and shape the breasts, and it often features a cupped design with a lace or satin trim.",
    "corn cob": "A corn cob is a long, slender, and slightly curved structure with rows of corn kernels attached to it.",
    "hunting bow": "A hunting bow is a type of archery equipment that is typically long, slender, and made of wood, metal, or composite materials.",
    "cowboy boot": "A cowboy boot is a type of footwear that is typically characterized by its tall, sturdy construction, pointed toe, and high, rounded heel.",
    "wheelbarrow": "A wheelbarrow is a small, handheld cart with one or two wheels and a handle for carrying loads.",
    "candle": "A candle is a cylindrical object with a wick in the center and a wax coating on the outside.",
    "ringlet butterfly": "Ringlet butterflies are small, delicate insects with a distinctive pattern of rings on their wings.",
    "cello": "A cello is a large, stringed musical instrument with a hollow body, four strings, and a spotted or flamed maple back and neck.",
    "ruddy turnstone": "The ruddy turnstone is a small bird with a distinctive black and white striped pattern on its back and a reddish-brown breast.",
    "sea cucumber": "Sea cucumbers are typically long and slender, with a soft and flexible body that can be quite elongated.",
    "manhole cover": "A manhole cover is typically a round, flat, metal plate with a raised center and a series of bolts or screws to secure it in place.",
    "desert grassland whiptail lizard": "The desert grassland whiptail lizard has a long, slender body and a tail that is longer than its body.",
    "dough": "Dough is a soft, pliable, and elastic mixture of flour, water, and sometimes yeast, which is typically rolled out into a flat, circular shape and then topped with various ingredients before being baked.",
    "Basenji": "Basenjis are a small, agile breed of dog known for their short, sleek coats and erect ears.",
    "espresso machine": "An espresso machine typically has a compact and sleek design, with a range of buttons and dials for controlling the brewing process, and a portafilter for holding and dispensing the ground coffee.",
    "St. Bernard": "St. Bernards are a large and muscular dog breed with a distinctive wrinkled face and a thick, dense double coat that can be either short or long.",
    "bighorn sheep": "Bighorn sheep are known for their large, curved horns and thick, woolly coats.",
    "Bedlington Terrier": "A Bedlington Terrier is a small, non-shedding dog with a distinctive lamb-like appearance, characterized by its long, curved tail, erect ears, and soft, woolly coat.",
    "prison": "A prison typically has high walls, barbed wire or electric fences, guard towers, and a secure perimeter to prevent escape.",
    "sundial": "A sundial is a timekeeping device that uses the position of the sun to cast a shadow on a central gnomon, which is a vertical object that moves along a hour line to indicate the time.",
    "fountain pen": "A fountain pen is a writing instrument that typically has a cylindrical body, a clip to attach it to a notebook, and a nib that is used to write with ink.",
    "cocktail shaker": "A cocktail shaker is a cylindrical container with a perforated top and a handle, used for mixing and shaking cocktails.",
    "Otterhound": "Otterhounds are large, muscular dogs with long, droopy ears and a distinctive, shaggy coat.",
    "racket": "A racket is a piece of sports equipment that consists of a handle and an oval or circular frame with a tightly strung mesh of strings.",
    "husky": "Huskies are known for their distinctive appearance, characterized by their thick, double coat of fur, erect ears, and almond-shaped eyes.",
    "wok": "A wok is a round-bottomed, sloping-sided pan with a concave bottom and high, sloping sides, typically made of metal and having a handle for easy lifting and stirring.",
    "necklace": "A necklace is a piece of jewelry that is typically worn around the neck and consists of a string of beads or other decorative elements.",
    "backpack": "A backpack is a piece of luggage that is typically carried on the back and has a strap that goes across the chest.",
    "jay": "A jay is a small, colorful bird with a crest on its head and a blue or greenish plumage.",
    "dung beetle": "Dung beetles are small insects with a round body, short antennae, and strong legs for digging.",
    "Yorkshire Terrier": "A Yorkshire Terrier is a small, non-shedding dog with a silky blue and tan coat, piercing brown eyes, and a confident, alert expression.",
    "yurt": "A yurt is a traditional Mongolian dwelling that is characterized by its circular shape, wooden frame, and felt covering.",
    "cucumber": "Cucumbers are long, green vegetables with a smooth skin and a slightly curved shape.",
    "common gallinule": "A common gallinule is a small, brown bird with a short tail, long legs, and a distinctive red beak.",
    "pole": "A pole is typically a long, slender object that is used to support or suspend things, and it can be made from a variety of materials such as wood, metal, or plastic.",
    "garbage truck": "A garbage truck is a large vehicle with a big bin on the back for collecting trash.",
    "schooner": "A schooner is a type of sailing vessel characterized by its multiple masts and fore-and-aft rigged sails, giving it a sleek and streamlined appearance.",
    "spoonbill": "Spoonbills are large, wading birds with long, curved bills and distinctive pink plumage.",
    "container ship": "A container ship is a large vessel designed to transport cargo in intermodal containers, featuring a hull that is typically painted in the company's livery, with multiple deck levels for stowage, and cranes or other loading equipment for handling the containers.",
    "church": "A church typically has a steeple, a cross, stained glass windows, and a bell tower.",
    "pug": "Pugs are a small, stocky breed of dog with a wrinkly face, a short muzzle, and a distinctive \"smooshed\" face.",
    "American Staffordshire Terrier": "The American Staffordshire Terrier is a medium-sized dog with a muscular build, short coat, and a distinctive heel-to-toe gait.",
    "mosque": "A mosque is a place of worship for Muslims, typically featuring a large, domed structure with a minaret and a crescent moon symbol on top.",
    "shopping basket": "A shopping basket typically has a round or oval shape with a handle for easy transportation.",
    "mask": "A mask is a flat, typically decorative, covering for the face that often has openings for the eyes and a slit or opening for the mouth.",
    "projector": "A projector is a device that projects images or videos onto a screen or wall, typically using a bright light source and a lens to focus the image.",
    "railroad car": "A railroad car is a long, narrow vehicle with a flat bottom and sides, and a roof, designed to carry freight or passengers.",
    "Groenendael dog": "Groenendael dogs are large, muscular, and have a distinctive black coat with a well-defined, dense undercoat.",
    "library": "A library typically has a quiet and calm atmosphere, with shelves filled with books and other resources, and comfortable seating areas for reading and studying.",
    "harvestman": "Harvestmen have a small, elongated body with eight legs and a pair of antennae.",
    "trolleybus": "A trolleybus is a type of bus that runs on electricity, typically from overhead wires or a third rail, and has a distinctive, elongated shape with a large front windshield and multiple doors for passengers to board and exit.",
    "hamper": "A hamper typically has a basket or bag-like structure with a handle for easy transport and a flat base for stability.",
    "night snake": "Night snakes are small, slender reptiles with smooth scales and large eyes that help them see in the dark.",
    "killer whale": "Killer whales are large, powerful marine mammals with a distinctive black and white color pattern.",
    "armadillo": "An armadillo is a small, gray mammal with a distinctive armored shell and a long, flexible tongue.",
    "spotlight": "A spotlight is a type of lighting fixture that is designed to focus a beam of light onto a specific area or object, typically used in theatrical performances or for illuminating a subject in photography or videography.",
    "whistle": "A whistle is a small, cylindrical object with a hole in the middle that produces a high-pitched sound when blown.",
    "Tibetan Terrier": "The Tibetan Terrier is a small, hardy breed with a dense, double coat that can be either coarse or soft, and a distinctive topknot of long, fine hair on the crown of the head.",
    "cliff dwelling": "A cliff dwelling is a type of ancient dwelling that is built into the side of a cliff or rock face, often featuring overhangs and other architectural elements that provide shelter and protection from the elements.",
    "Welsh Springer Spaniel": "The Welsh Springer Spaniel is a medium-sized dog with a long, silky coat and a distinctive mustache and beard.",
    "tile roof": "A tile roof is typically characterized by its interlocking shingles made of ceramic or clay material, which come in various colors and patterns, and are designed to protect the building from weather elements while adding an aesthetic appeal to the structure.",
    "mailbox": "A mailbox is typically a rectangular or cylindrical container with a hinged door and a slot for inserting mail.",
    "gas pump": "A gas pump is a tall, freestanding device with a nozzle for dispensing gasoline or diesel fuel.",
    "typewriter keyboard": "A typewriter keyboard typically features a set of alphanumeric keys, including letters, numbers, punctuation marks, and function keys, arranged in rows for easy access and visibility.",
    "shipwreck": "A shipwreck is a scene of devastation, with the remains of a once-majestic vessel now resting in pieces at the bottom of the ocean.",
    "daisy": "Daisies are known for their bright white petals and yellow center, with a distinctive circular shape.",
    "bee": "Bees are small, flying insects with a distinctive striped pattern on their bodies and large, round eyes.",
    "minivan": "A minivan is a type of vehicle that is typically characterized by its spacious interior, sliding doors, and a boxy or slightly rounded shape.",
    "frilled-necked lizard": "A frilled-necked lizard has a long, slender body with a distinctive frill of skin around its neck.",
    "hair clip": "A hair clip is a small, cylindrical object with a spring mechanism that is used to hold hair in place.",
    "academic gown": "An academic gown is a long, pointed robe with a hood that signifies the wearer's field of study or degree earned.",
    "hourglass": "An hourglass is a timekeeping device that typically consists of two conical or cylindrical vessels connected by a narrow neck, with sand flowing through the neck from one vessel to the other.",
    "gossamer-winged butterfly": "Gossamer-winged butterflies are known for their delicate, filmy wings that are almost transparent, and their small, slender bodies.",
    "soda bottle": "A soda bottle typically has a clear or translucent body with a colored label and a bottle cap.",
    "kit fox": "A kit fox is a small, slender mammal with a distinctive white-tipped tail, large ears, and a bushy tail.",
    "patio": "A patio is an outdoor space that is typically paved with materials such as concrete, brick, or stone, and is often surrounded by a low wall or fence.",
    "miniskirt": "A miniskirt is a short, pleated skirt that typically reaches the mid-thigh.",
    "tobacco shop": "A tobacco shop typically has a display case filled with various types of tobacco products, such as cigarettes, cigars, and loose tobacco.",
    "saxophone": "A saxophone is a musical instrument that is typically made of brass and has a curved, elongated shape with a flared bell at one end and a mouthpiece at the other.",
    "Nile crocodile": "The Nile crocodile has a long, slender snout and a distinctive lump on its forehead.",
    "skunk": "A skunk is a small, striped mammal with a bushy tail and a distinctive black and white striped pattern on its fur.",
    "hippopotamus": "A hippopotamus is a large, gray animal with a distinctive short tail, wide mouth, and large, flat ears.",
    "printer": "A printer is a peripheral device that produces a printed copy of digital data on physical paper.",
    "Siberian Husky": "Siberian Huskies are known for their striking blue eyes, erect ears, and thick, double coat of fur.",
    "sunglasses": "Sunglasses are a type of eyewear that are designed to protect the eyes from the sun's harmful ultraviolet (UV) rays and to reduce glare. They typically have a frame and lenses, and may also have a bridge and nose pads for comfort and support. Sunglasses come in a variety of styles, colors, and materials, and may have additional features such as polarized lenses or mirrored coatings.",
    "Greater Swiss Mountain Dog": "The Greater Swiss Mountain Dog is a large, muscular dog with a distinctive black and rust-colored coat, a bushy tail, and a friendly expression.",
    "rhinoceros beetle": "Rhinoceros beetles are known for their large size, impressive horns, and distinctive spiky antennae.",
    "Appenzeller Sennenhund": "The Appenzeller Sennenhund is a large, muscular dog with a distinctive black and white coat.",
    "goldfinch": "Goldfinches are small, colorful birds with bright yellow plumage and black wings.",
    "American dipper": "The American dipper is a small, stocky bird with a short tail, a long, curved bill, and a distinctive white eyebrow.",
    "potter's wheel": "A potter's wheel is a large, round, and flat surface with a hole in the center, used for shaping clay into pottery.",
    "American bullfrog": "The American bullfrog is characterized by its large size, greenish-brown skin, and distinctive deep, bass croak.",
    "solar thermal collector": "A solar thermal collector is a device that uses the sun's energy to heat a fluid, such as water or air, and typically consists of a flat, rectangular box with a glass or plastic cover on the top, and a series of pipes or tubes inside to carry the fluid.",
    "sarong": "A sarong is a long, rectangular piece of fabric that is typically wrapped around the waist and worn as a skirt or dress.",
    "Komodo dragon": "Komodo dragons are large, long-tailed reptiles with a distinctive spiky ridge on their backs and a long, prehensile tongue.",
    "cardboard box / carton": "A cardboard box typically has a flat base and sides, with a corrugated or wavy pattern on the sides for added strength and rigidity.",
    "Chow Chow": "Chow Chows are a breed of dog that are known for their distinctive appearance, which includes a thick, fluffy coat of fur, a broad and sturdy build, and a distinctive mane that falls over their eyes.",
    "vaulted or arched ceiling": "A vaulted or arched ceiling typically features a curved or pointed design that creates a sense of spaciousness and adds an element of architectural interest to a room.",
    "red panda": "A red panda is a small, furry mammal with a distinctive reddish-brown coat, a bushy tail, and large, pointed ears.",
    "baluster / handrail": "A baluster is a vertical post or pillar that is typically found in staircases, balconies, and other architectural structures. It is usually made of wood, metal, or stone, and has a decorative design that adds an aesthetic element to the structure. Balusters can come in a variety of shapes and sizes, and may feature intricate carvings, patterns, or other decorative elements. They are typically installed in a row or a series of rows to provide support and stability to the structure, as well as to add visual interest.",
    "Kerry Blue Terrier": "The Kerry Blue Terrier is a small, muscular dog with a distinctive blue-gray coat, expressive eyes, and a confident demeanor.",
    "leopard": "A leopard is a large, muscular cat with a short, sleek coat that is typically covered in a pattern of irregularly-shaped, dark-colored spots.",
    "cuirass": "A cuirass is a piece of armor that covers the torso and is typically made of metal plates over a padded or textile garment.",
    "corn": "Corn is a tall, stalk-like plant with long, slender leaves and a large, round head of corn kernels.",
    "brass memorial plaque": "A brass memorial plaque typically features a polished, reflective surface with raised lettering or engravings, often used to commemorate a person or event.",
    "african grey parrot": "African grey parrots are known for their vibrant colors, including a mix of grays, greens, and reds, as well as their distinctive black beaks and zygotic feathers.",
    "triumphal arch": "A triumphal arch is a large, curved structure that is typically found in ancient Roman architecture and is often decorated with intricate carvings and sculptures.",
    "paper towel": "A paper towel is a thin, absorbent sheet of paper that is designed to be used for drying hands or surfaces.",
    "worm snake": "A worm snake is a small, slender reptile with a long, flexible body and a smooth, shiny skin.",
    "common sorrel horse": "A common sorrel horse typically has a reddish-brown coat with a black mane and tail, along with white markings on its face and legs.",
    "sea snake": "Sea snakes are typically small to medium-sized snakes with long, slender bodies and a distinctive head shape, often featuring large eyes and a flattened, broad head.",
    "porcupine": "A porcupine is a small, rodent-like mammal with a stocky body, short legs, and a tail that ends in a tuft of hair. It has a distinctive coat of quills, which are specialized hairs that can easily detach and embed into the skin of a predator or other animals that come too close. The quills are typically dark in color and can be up to a few inches long. In addition to the quills, the porcupine's coat also has longer, softer hairs that help to insulate the animal and protect it from the elements.",
    "common squirrel monkey": "A common squirrel monkey has a small body, long tail, and a bushy, black-tipped tail.",
    "guenon": "Guenons are small to medium-sized monkeys with short, dense fur, a bushy tail, and a distinctive mohawk-like strip of hair running down their back.",
    "jeans": "Jeans are typically characterized by their blue or light blue color, sturdy denim fabric, and distinctive fading and wear patterns that develop over time with use.",
    "safe": "A safe is a rectangular or square-shaped container with a locking mechanism, typically made of metal and featuring a reinforced door with a lock slot.",
    "red-breasted merganser": "A red-breasted merganser is a large, slender bird with a long, thin beak and a distinctive red breast.",
    "green iguana": "A green iguana is a large, long-tailed reptile with a bright green body, a row of spines running down its back, and a prehensile tail.",
    "strainer": "A strainer is a kitchen utensil with a perforated or mesh bottom, used for draining liquid or separating solids from liquids.",
    "doormat": "A doormat is a flat, usually rectangular, textile or rubber mat that is placed outside of a door to absorb moisture and dirt from people's shoes.",
    "coffeemaker": "A coffeemaker is a small kitchen appliance that is designed to brew coffee by forcing hot water through ground coffee beans.",
    "American robin": "The American robin is a medium-sized bird with a reddish-orange breast, gray-brown back, and a distinctive head with a gray-brown crown and a white eye-ring.",
    "desktop computer": "A desktop computer typically consists of a monitor, a keyboard, and a mouse, all of which are designed to work together to display and interact with digital information.",
    "photocopier": "A photocopier is a machine that is used to make copies of documents by using a process that involves passing light through a lens to create an image on a photosensitive drum, which is then transferred to paper.",
    "horse-drawn vehicle": "A horse-drawn vehicle is a traditional mode of transportation that features a carriage or wagon being pulled by one or more horses.",
    "llama": "Llamas are large, furry mammals with long necks, large, curved horns, and a distinctive hump on their backs.",
    "hen": "A hen is a type of domesticated bird that is typically characterized by its small size, brown and black feathers, and a distinctive crest on its head.",
    "knee pad": "A knee pad is a small, padded cushion that is designed to be worn on the knee for protection and support.",
    "bridegroom": "The bridegroom was a handsome young man with a tall and slender build, chiseled features, and piercing blue eyes.",
    "gong": "A gong is a large, flat, circular object that is typically made of metal and has a deep, resonant sound when struck.",
    "strawberry": "A strawberry is a small, round, red fruit with a green top and a smooth, shiny skin.",
    "tape player": "A tape player is a device that plays cassette tapes and typically has a rectangular shape with a handle for easy transport.",
    "hot pot": "A hot pot is a large, round-bottomed pot with a handle and a lid, typically made of metal or ceramic.",
    "bulletproof vest": "A bulletproof vest is a type of protective clothing that is designed to withstand ballistic impact and protect the wearer from gunshots.",
    "hammerhead shark": "Hammerhead sharks are known for their distinctive elongated heads and large, wide-set eyes.",
    "sulphur butterfly": "The sulphur butterfly has bright yellow wings with black and orange markings.",
    "European polecat": "The European polecat has a distinctive black-and-white striped pattern on its fur.",
    "bittern bird": "Bittern birds are characterized by their long legs, tall stature, and distinctive striped plumage.",
    "Dungeness crab": "Dungeness crabs are known for their large size, brownish-red color, and distinctive spiky legs.",
    "great white shark": "A great white shark is a large, predatory fish with a sleek, streamlined body, a broad, rounded snout, and sharp, serrated teeth.",
    "tent": "A tent is a temporary shelter made of fabric and supported by poles, typically with a peak and a doorway.",
    "peafowl": "A peafowl is a large and colorful bird with a long tail and an elaborate crest on its head.",
    "Schipperke": "The Schipperke is a small, agile dog with a fox-like appearance, a thick double coat, and piercing black eyes.",
    "neck brace": "A neck brace is a medical device that is designed to provide support and stability to the neck and spine, and it typically consists of a rigid or semi-rigid frame that is covered with padding and a breathable fabric.",
    "buckle": "A buckle is a metal frame with a curved or angular shape, typically used for fastening or securing straps or cords.",
    "tandem bicycle": "A tandem bicycle is a type of bicycle that has two seats, one behind the other, and is designed for two people to ride together.",
    "mongoose": "A mongoose is a small, slender mammal with a long tail, bushy tail, and a distinctive striped pattern on its fur.",
    "pelican": "A pelican is a large bird with a long beak and a distinctive pouch under its chest.",
    "American black bear": "American black bears are typically characterized by their large size, shaggy fur, and a distinctive hump on their shoulders.",
    "pretzel": "A pretzel is a twisted, knotty bread that is typically golden brown in color and has a crispy, chewy texture.",
    "golf ball": "A golf ball is typically small, round, and covered in a dimpled pattern.",
    "English foxhound": "English foxhounds are known for their large size, long legs, and distinctive droopy ears.",
    "proboscis monkey": "The proboscis monkey is a large, long-nosed primate with distinctive facial features and a prehensile, elongated tongue.",
    "CRT monitor": "A CRT monitor is a large, bulky device with a screen that is illuminated by a cathode ray tube, which creates a visible image by striking a phosphorescent surface with an electron beam.",
    "handkerchief": "A handkerchief is a small, usually square or rectangular piece of cloth that is folded into a triangle or half-moon shape and held in the hand to absorb perspiration or blow the nose.",
    "Shetland Sheepdog": "Shetland Sheepdogs are small, agile dogs with a thick double coat of fur that can be either straight or slightly wavy, and a distinctive mane that stands upright along their neck.",
    "minibus": "A minibus is a small vehicle with a compact design, typically featuring a flat front, sliding doors, and a rear cargo area.",
    "brussels griffon": "Brussels Griffons are a small breed of dog with a distinctive appearance, characterized by their short, smooth coat, large expressive eyes, and a wrinkled face with a short muzzle.",
    "hummingbird": "Hummingbirds are small, colorful birds with iridescent feathers and long, slender bills.",
    "silver salmon": "A silver salmon has a sleek, streamlined body with a metallic sheen, and is characterized by its large, hooked jaw and distinctive black spots.",
    "soap dispenser": "A soap dispenser is a small container with a pump or a faucet that dispenses soap when pressed or turned.",
    "mop": "A mop typically has a long handle and a head with a set of cleaning cloths or fibers attached to it.",
    "microwave oven": "A microwave oven is a small kitchen appliance with a silver or black exterior and a glass door that covers the interior, where the food is heated by microwave radiation.",
    "weevil": "Weevils are small, slender insects with a distinctive snout and elongated body.",
    "bell or wind chime": "A bell or wind chime typically has a hollow, cylindrical shape with a flared opening at the top and a clapper or striker inside that produces a ringing or clanging sound when the bell is struck by the wind.",
    "computer keyboard": "A computer keyboard typically has a rectangular shape with a set of alphanumeric keys, function keys, and a numeric keypad.",
    "pomegranate": "A pomegranate is a round fruit with a tough, leathery skin that is typically red or yellow in color, and is dotted with numerous small, round, red seeds.",
    "water snake": "Water snakes are typically long and slender, with smooth scales that help them glide effortlessly through the water.",
    "snail": "Snails are small, slimy creatures with a spiral shell and a soft, elongated body.",
    "mountain": "A mountain is a large, elevated landform with a steep, often rocky or grassy surface, and is typically covered in vegetation and may have snow or ice on its peaks.",
    "submarine": "A submarine is a long, narrow vessel with a streamlined shape and a conning tower at the front.",
    "weighing scale": "A weighing scale typically consists of a platform or tray for placing the object to be weighed, a set of weights or load cells to measure the weight, and a display or indicator to show the weight.",
    "snorkel": "A snorkel is a tube-like device that is worn over the mouth and nose, allowing the wearer to breathe while keeping their face submerged in water.",
    "hair wig": "A hair wig is a head covering made of artificial or natural hair that is designed to be worn on the head for various purposes, such as for religious or cultural reasons, for fashion, or for medical reasons such as hair loss. Hair wigs come in a variety of styles, colors, and textures, and can be made from a range of materials, including synthetic fibers, human hair, and even animal hair. They are typically attached to a base made of plastic or silicone, which is worn on the scalp and holds the wig in place. Hair wigs can be styled in a variety of ways, and can be worn in a variety of settings, from formal events to everyday wear.",
    "CD player": "A CD player is a device that plays compact discs and typically has a slot for inserting the disc, a display screen that shows the current track and time elapsed, and buttons for controlling playback.",
    "prayer rug": "A prayer rug is a flat, rectangular textile that is typically used for Islamic prayer and is often decorated with intricate patterns and designs.",
    "toy terrier": "A toy terrier is a small, sturdy dog with a wiry coat, erect ears, and a confident demeanor.",
    "green mamba": "The green mamba is a slender, long-bodied snake with a distinctive greenish-black coloration and a white or yellowish belly.",
    "electric locomotive": "An electric locomotive is a large, powerful machine with a prominent pantograph on the roof for collecting electrical energy from overhead lines.",
    "wall clock": "A wall clock typically has a circular face with hour and minute hands, and may also have a second hand, as well as numbers or markers for the hours.",
    "ruffed grouse": "The ruffed grouse is a small, plump bird with a distinctive fan-shaped tail and a short, curved beak.",
    "space heater": "A space heater is a small, portable heating appliance that is designed to provide warmth to a specific area or room.",
    "water buffalo": "Water buffalo are large, gray animals with long, curved horns and a distinctive hump on their shoulders.",
    "albatross": "Albatrosses are large seabirds with long wings, webbed feet, and a distinctive hooked beak.",
    "baboon": "Baboons are large, agile primates with short, coarse fur and a distinctive, broad-based tail.",
    "cardoon": "A cardoon is a tall, stalk-like vegetable with a thick, rough exterior and a hollow, fibrous interior.",
    "sewing machine": "A sewing machine is a device with a needle and thread that is used for sewing fabric together.",
    "padlock": "A padlock typically has a rectangular or circular body with a shackle that connects the body to the locking mechanism, and a keyhole for inserting a key.",
    "coffee mug": "A coffee mug typically has a handle, a body, and a lip or rim.",
    "ambulance": "An ambulance is typically characterized by its red and white color scheme, flashing lights, and a distinctive siren.",
    "harp": "A harp is a musical instrument that typically has a wooden frame with a resonator, a neck, and strings that are plucked or strummed with the fingers.",
    "abacus": "An abacus is a counting device that typically consists of a frame with beads or other markers that are moved along rods or wires to represent numbers.",
    "ford model t": "The Ford Model T was a small, compact car with a simple, boxy design and a black painted body.",
    "honeycomb": "A honeycomb is a hexagonal structure made up of many small cells.",
    "stretcher": "A stretcher is a long, flat, narrow piece of equipment with handles or straps at each end to secure a patient.",
    "Miniature Pinscher": "Miniature Pinschers are small, sturdy dogs with a sleek, short coat and a distinctive mustache and beard.",
    "table lamp": "A table lamp typically consists of a tall, slender base that supports a shade and a lamp socket, with a flexible arm that allows the lamp to be adjusted to direct the light where it is needed.",
    "howler monkey": "Howler monkeys are known for their large size, long tail, and distinctive black facial markings.",
    "Petri dish": "A Petri dish is a shallow, round, flat-bottomed container made of glass or plastic, typically used for growing and observing small organisms or cultures.",
    "ant": "Ants are small, social insects with a distinctive elbowed antennae and a segmented body.",
    "fishing casting reel": "A fishing casting reel typically has a round, cylindrical body with a spool of line inside, a handle for winding and unwinding the line, and a drag system to control the tension on the line as it is being reeled in.",
    "gazelle": "Gazelles are known for their slender bodies, long legs, and distinctive facial markings.",
    "scabbard": "A scabbard is a long, narrow sheath made of leather or other materials, designed to protect the blade of a sword or other similar weapons when they are not in use.",
    "Bullmastiff": "Bullmastiffs are a large and powerful breed of dog, known for their muscular build, short and smooth coat, and distinctive wrinkled forehead.",
    "tricycle": "A tricycle is a three-wheeled vehicle with a frame, two wheels, and a saddle or seat for the rider.",
    "taxicab": "A taxicab is a type of vehicle that is typically yellow and has a distinctive shape, with a large front windshield and a roof sign that displays the taxi company's logo or name.",
    "eggnog": "Eggnog is a creamy, frothy beverage with a rich, yellow color and a slightly thick texture.",
    "orange": "An orange is a round, orange-colored fruit with a smooth skin and a small, stem-like protrusion at the top.",
    "couch": "A couch is a piece of furniture that is typically large, soft, and comfortable, with a backrest and armrests, and is often upholstered in fabric or leather.",
    "Scottish Terrier": "Scottish Terriers are a small, sturdy breed of dog with a distinctive mustache and beard, a wiry coat, and a confident, bold expression.",
    "toaster": "A toaster is a small kitchen appliance with a slotted front and a lever or button to lower the toasting element.",
    "safety pin": "A safety pin is a small, cylindrical object with a sharp point at one end and a spring mechanism at the other end, designed to securely hold fabric in place.",
    "tabby cat": "A tabby cat typically has a distinctive coat pattern that features a mix of different colors, such as brown, black, and white, along with distinctive \"M\" shaped markings on the forehead.",
    "grocery store": "A grocery store typically has aisles filled with various products, such as fruits, vegetables, and packaged goods, displayed on shelves and in refrigerated cases.",
    "tool kit": "A tool kit typically consists of a variety of small, handheld tools that are used for performing different tasks, such as wrenches, pliers, and screwdrivers.",
    "wool": "Wool is a natural fiber that is obtained from the fleece of sheep and is characterized by its soft, curly, and fluffy texture.",
    "fig": "A fig is a small, round fruit with a smooth skin that is often green or purple in color.",
    "police van": "A police van is typically characterized by its large size, white or light-colored exterior, and the presence of flashing lights and a siren on the roof.",
    "obelisk": "An obelisk is a tall, four-sided, narrow tapering monument that ends in a pyramid-like shape at the top.",
    "airliner": "An airliner is a large, long, and wide aircraft with multiple engines and a pressurized cabin.",
    "drink pitcher": "A drink pitcher is typically a large, round container with a handle and a spout for pouring liquid.",
    "trench coat": "A trench coat is a type of double-breasted coat that typically has a wide collar, a front belt, and large pockets.",
    "Bouvier des Flandres dog": "The Bouvier des Flandres is a large, muscular dog with a distinctive beard and mustache.",
    "mitten": "A mitten is a type of glove that is typically made of thick, warm fabric and has a small opening at the top to fit over the wrist.",
    "cloak": "A cloak is a long, loose garment that is typically worn over other clothing and has a hood to cover the head and neck.",
    "bulbul": "Bulbuls are small, colorful birds with short tails and stubby wings.",
    "maypole": "A maypole is typically a tall, slender wooden pole that is often decorated with ribbons, garlands, or other festive adornments.",
    "punching bag": "A punching bag is typically a large, inflatable bag with a soft exterior and a sturdy frame, designed for use in martial arts training and boxing practice.",
    "tailed frog": "A tailed frog typically has a slender body, long legs, and a distinctive tail that it uses for swimming and propulsion in the water.",
    "revolver": "A revolver is a type of handgun that has a cylindrical barrel and a revolving mechanism for loading and firing multiple rounds of ammunition.",
    "payphone": "A payphone is a public telephone that is typically found in locations such as train stations, airports, and other high-traffic areas. It usually has a coin slot or card reader for payment, a dial pad for making calls, and a small screen or display that shows the amount of change or credit remaining. Payphones are often colorful and have a distinctive design to make them easily recognizable.",
    "terrapin": "A terrapin is a small, brown reptile with a hard shell on its back and a long, slender tail.",
    "radio telescope": "A radio telescope is a large, dish-shaped structure that is used to observe and collect data from celestial objects using radio waves.",
    "brown bear": "Brown bears are large mammals with a distinctive hump on their shoulders, long claws, and a thick, shaggy coat of fur that can range in color from light brown to nearly black.",
    "gondola": "A gondola is a traditional flat-bottomed rowing boat that is typically used for transportation on narrow canals and rivers in Venice, Italy.",
    "clothes iron": "A clothes iron typically has a long handle, a heating element, and a flat surface for pressing clothes.",
    "rain barrel": "A rain barrel is typically a large, cylindrical container with a spout for draining water and a lid to cover the opening.",
    "Staffordshire Bull Terrier": "A Staffordshire Bull Terrier is a small, muscular dog with a broad head, strong jaw, and a short, smooth coat that can be found in a variety of colors.",
    "Standard Schnauzer": "A Standard Schnauzer is a medium-sized dog with a distinctive mustache and beard, a bushy eyebrow, and a wiry coat that can be found in three different colors.",
    "black swan": "A black swan is a large bird with a sleek, shiny black body, a long neck, and a distinctive S-shaped curve in its neck.",
    "wooden spoon": "A wooden spoon typically has a long handle and a rounded, spoon-shaped head.",
    "tick": "A tick is a small, brown, eight-legged parasite with a distinctive head that is larger than its body.",
    "English Springer Spaniel": "The English Springer Spaniel is a medium-sized dog with a long, silky coat that comes in a variety of colors, including liver and white, black and white, and tricolor.",
    "salt shaker": "A salt shaker typically has a cylindrical body with a perforated top and a narrow, conical bottom, and may have a metal or plastic grate inside to allow the salt to flow out easily.",
    "acorn squash": "Acorn squash is a type of squash that has a distinctive, elongated shape and a deep, orange-yellow color.",
    "lens cap": "A lens cap is a small, circular piece of plastic or metal that attaches to the front of a camera lens to protect it from dust, dirt, and scratches when the lens is not in use.",
    "Irish Setter": "Irish Setters are known for their long, silky coats and distinctive red or mahogany color, as well as their friendly and outgoing personalities.",
    "vespa": "A vespa is a type of scooter that is characterized by its elongated, narrow shape and a step-through frame.",
    "goldfish": "Goldfish are small, brightly colored, freshwater fish with a distinctive hump on their forehead and a long, flowing tail.",
    "Crock Pot": "A Crock Pot is a slow cooker with a ceramic or glass lid and a heating element that cooks food at a low temperature for an extended period of time.",
    "wallet": "A wallet typically has a flat, rectangular shape with a fold in the middle, and it is made of leather or a similar material.",
    "balance beam": "A balance beam is a long, narrow, and flexible beam that is typically made of wood or metal and has a smooth, curved surface.",
    "chainsaw": "A chainsaw is a handheld power tool that consists of a motorized chain with saw teeth attached to a rotating drum, a handle for holding and maneuvering, and a guide bar that directs the chain.",
    "pencil sharpener": "A pencil sharpener is a small, handheld device with a round, cylindrical body and a single, narrow slit running through its center.",
    "plastic bag": "A plastic bag is typically made of a lightweight, transparent material with a smooth surface and a slightly glossy finish.",
    "borzoi": "A borzoi is a tall, slender dog with long legs, a long body, and a long, flowing coat.",
    "oscilloscope": "An oscilloscope is a device that displays waveform signals on a screen, typically with vertical and horizontal axes, and often with color-coding to indicate different signal properties.",
    "china cabinet": "A china cabinet is a tall, freestanding cabinet with glass doors and shelves, designed to display and store fine china, glassware, and other delicate items.",
    "plate": "A plate is a flat, round object with a raised edge, typically used for serving food.",
    "electric fan": "An electric fan is a small, portable device that is designed to circulate air in a room or space.",
    "school bus": "A school bus is a large, yellow vehicle with a distinctive design that includes a bright yellow body, black trim, and red and amber flashing lights.",
    "lacewing": "Lacewings are delicate, winged insects with intricate patterns on their wings that resemble lace.",
    "teddy bear": "A teddy bear typically has a soft, plush body, round, plump cheeks, and a friendly, smiling face with button eyes.",
    "sweatshirt": "A sweatshirt is a type of clothing that is typically made of a soft, warm fabric and has a hood and long sleeves.",
    "mashed potatoes": "Mashed potatoes are a creamy, smooth, and fluffy dish made from boiled potatoes that have been mashed with milk, butter, and seasonings.",
    "accordion": "An accordion is a musical instrument that has a compact, folding design with a row of buttons or keys on the front and a bellows that is used to produce sound.",
    "motorboat": "A motorboat is a type of watercraft that is typically powered by one or more engines and is designed for recreational or transportation purposes on the water.",
    "Bloodhound": "Bloodhounds are known for their long, droopy ears and wrinkled faces.",
    "comic book": "A comic book typically consists of a series of illustrations or images, often accompanied by text, arranged in a sequential manner to tell a story.",
    "bell tower": "A bell tower typically features a tall, slender structure with a bell chamber at the top, often adorned with intricate carvings and decorative elements.",
    "Shih Tzu": "Shih Tzu is a small, long-haired dog with a distinctive topknot on its head and a long, flowing coat.",
    "loupe magnifying glass": "A loupe magnifying glass is a small, handheld magnifying device that is typically used to examine small objects or to read fine print. It consists of a single or double convex lens that is mounted in a frame, which is usually made of metal or plastic. The lens is designed to magnify the image that it sees, making it easier to see small details. Loupe magnifying glasses are often used by jewelers, watchmakers, and other professionals who need to examine small objects closely. They are also popular among hobbyists and collectors who enjoy examining coins, stamps, and other small items.",
    "Rottweiler": "Rottweilers are a large and muscular breed of dog with a distinctive black and rust-colored coat.",
    "hartebeest": "A hartebeest is a large, wild herbivorous mammal with long legs, a muscular build, and distinctive curved horns.",
    "loggerhead sea turtle": "A loggerhead sea turtle has a large, muscular body with a distinctive, rounded head and a brownish-black shell with patches of light brown or greenish-blue.",
    "red wolf or maned wolf": "The red wolf, also known as the maned wolf, is characterized by its long, shaggy fur, bushy tail, and large, pointed ears.",
    "garter snake": "Garter snakes are typically small, slender, and have a distinctive striped pattern on their bodies.",
    "modem": "A modem is a device that is used to connect a computer or other device to the internet, and it typically has a number of ports for connecting to other devices, as well as lights or indicators to show its status.",
    "swimming cap": "A swimming cap is a tight-fitting head covering designed to reduce drag and improve hydrodynamics while swimming.",
    "flamingo": "Flamingos are known for their distinctive appearance, which includes long legs, a slender neck, and a unique beak adapted for filtering food from the water.",
    "black-footed ferret": "Black-footed ferrets are small, slender mammals with short legs, a long body, and a bushy tail.",
    "freight car": "A freight car is a large, sturdy vehicle designed to transport goods and materials over long distances.",
    "ostrich": "Ostriches are large, flightless birds with long legs, a long neck, and a distinctive fan-shaped tail.",
    "milk can": "A milk can is typically a cylindrical container with a flat base and a handle for carrying.",
    "Persian cat": "Persian cats are known for their long, fluffy coats and expressive, round faces.",
    "crate": "A crate is a container with a flat base and sides, typically made of wood or plastic, and is often used for storing or transporting goods.",
    "paddle wheel": "A paddle wheel is a circular device with a series of flat, paddle-like blades attached to a central hub, which is used for propulsion in watercraft.",
    "brain coral": "Brain corals are characterized by their complex, branching skeletons and intricate, feathery polyps.",
    "baby pacifier": "A baby pacifier is a small, usually round, plastic object with a nipple-like shape on one end that is designed to be sucked on by infants to soothe them.",
    "park bench": "A park bench typically consists of a seating area, usually made of wood or metal, with a backrest and armrests, and may have a slatted or solid surface.",
    "pinwheel": "A pinwheel is a colorful, spinning object with a central axis and a series of radially arranged blades or vanes.",
    "dumbbell": "A dumbbell is a piece of exercise equipment that consists of a handle and two weights that are connected by a bar.",
    "artichoke": "An artichoke typically has a large, green head with spiky, serrated leaves surrounding a central, edible core.",
    "threshing machine": "A threshing machine is a large, heavy-duty piece of farm equipment with a rotating drum and sharp blades for separating grain from straw.",
    "Sussex Spaniel": "The Sussex Spaniel is a medium-sized dog with a sturdy, compact build and a short, dense coat that comes in a variety of colors, including liver, red, or black with white markings.",
    "brambling": "A brambling is a small bird with a distinctive black and white striped pattern on its body.",
    "trilobite": "Trilobites are characterized by their distinctive three-lobed body shape and hard, exoskeletal carapace.",
    "trash can": "A trash can is typically a cylindrical container with a lid, designed for holding and disposing of waste.",
    "go-kart": "A go-kart is a small, lightweight vehicle with a simple frame, four wheels, and a seat for one or two passengers.",
    "rooster": "A rooster is a large, colorful bird with a distinctive crest of upright feathers on its head and a long, curved tail.",
    "digital clock": "A digital clock typically displays the time using numerical digits rather than traditional clock hands.",
    "desk": "A desk typically has a flat surface with a smooth finish, and may also have drawers, shelves, or other storage compartments.",
    "wild boar": "A wild boar is a large, muscular animal with a thick, bristly coat of hair, a broad snout, and tusks that can grow quite long.",
    "microphone": "A microphone is a small device with a diaphragm, a voice coil, and a magnet that converts sound waves into electrical signals.",
    "restaurant": "The restaurant has a warm and inviting atmosphere, with a cozy ambiance created by the soft lighting and comfortable seating arrangements.",
    "balaclava ski mask": "A balaclava ski mask is a type of headwear that covers the entire head and face, typically made of warm, breathable material with small holes or slits for ventilation, and often features a full-face design with a mesh or perforated pattern.",
    "through arch bridge": "A through arch bridge is characterized by its two abutments and a central arch that spans the width of the bridge, providing a clear and unobstructed passage for vehicles and pedestrians to cross.",
    "sandbar": "A sandbar is a narrow, elongated deposit of sand that forms in a body of water and is typically characterized by its shallow depth and sandy surface.",
    "basketball": "A basketball is a round, bouncy ball with a smooth, leather surface and a distinctive pattern of grooves.",
    "agama": "Agamas are small to medium-sized lizards with long necks, legs, and tails, and they typically have a spiny or wavy pattern on their backs.",
    "chameleon": "Chameleons are known for their long necks, distinctive eyes, and the ability to change color.",
    "spiny lobster": "Spiny lobsters have a distinctive appearance, characterized by their long, slender bodies, large, fan-like tail, and numerous spines covering their bodies.",
    "bookcase": "A bookcase typically consists of shelves for holding books and other items, and may also have features such as doors, drawers, or cabinets for additional storage or organization.",
    "lampshade": "A lampshade is a round, flat, and usually white or light-colored object that is designed to cover the light bulb in a lamp.",
    "snowmobile": "A snowmobile is a small, motorized vehicle designed for traveling over snow-covered terrain, featuring a seat for one or more passengers, a handlebar for steering, and skis or a track for traction.",
    "volleyball": "A volleyball is a round, hollow rubber ball with a leather or synthetic cover, typically white or yellow in color.",
    "coral fungus": "Coral fungi are characterized by their brightly colored, fleshy, and often branching structures that resemble coral.",
    "hoop skirt": "A hoop skirt is a type of skirt that is characterized by its full, circular shape and the hoops that are used to support it.",
    "barometer": "A barometer is a device used to measure atmospheric pressure, and it typically has a dial or gauge that displays the current pressure level.",
    "throne": "A throne is a type of seating that is typically elevated and often ornately decorated, with a high back and armrests, and may have a cushion or upholstery for added comfort.",
    "stupa": "A stupa is a large, hemispherical structure with a pointed top, often adorned with intricate carvings and decorations.",
    "unicycle": "A unicycle is a single-wheeled vehicle with a seat and a frame, and it is typically ridden by standing on the seat and holding onto a handlebar.",
    "Australian Silky Terrier": "The Australian Silky Terrier is a small, non-shedding breed with a silky blue and tan coat and expressive, dark eyes.",
    "stick insect": "Stick insects are known for their long, slender bodies and their ability to blend in with their surroundings through a form of camouflage called \"disruptive coloration.\"",
    "lorikeet": "Lorikeets are small, colorful birds with long, curved beaks and zygotic feathers.",
    "parking meter": "A parking meter is a device used to collect payment for parking in a designated space, typically found on streets and in parking lots.",
    "king penguin": "King penguins are large, majestic birds with a distinctive black crown, orange beak, and a black and white striped pattern on their chest and back.",
    "soccer ball": "A soccer ball is typically round in shape with a smooth, leather surface and a distinctive pattern of hexagonal and pentagonal panels.",
    "collie": "A collie is a herding dog that typically has a slim, athletic build, a long muzzle, and a dense double coat that can be either rough or smooth.",
    "Irish Terrier": "The Irish Terrier is a small, sturdy dog with a distinctive red or red-brown coat, a black nose, and piercing blue eyes.",
    "Australian Kelpie": "Australian Kelpies are known for their distinctive short, coarse, and dense fur, which can be found in a variety of colors including red, black, and tan.",
    "European green lizard": "The European green lizard has a slender body, long legs, and a bright green coloration with yellowish or orange markings on its head and sides.",
    "carousel": "A carousel is a merry-go-round with a circular platform that rotates around a central axis, and is typically adorned with colorful and intricate designs, often featuring horses or other animals as ride options.",
    "holster": "A holster is a piece of equipment used to carry and store a handgun, typically made of leather or other durable materials, with a sturdy clip or belt loop for attaching it to a belt or waistband.",
    "sloth bear": "Sloth bears are characterized by their long, shaggy fur, large curved claws, and a distinctive hump on their shoulders.",
    "Great Pyrenees dog": "Great Pyrenees dogs are known for their large size, thick white double coat, and distinctive facial features, including a broad forehead, dark eyes, and a black nose.",
    "Malinois": "The Malinois is a medium-sized dog with a sleek, muscular build, a short, dense coat, and a distinctive mane of long, flowing hair down the back of its neck.",
    "coral reef": "A coral reef is a complex and diverse ecosystem characterized by a variety of colorful and intricate structures, including hard and soft corals, algae, and other marine organisms.",
    "apron": "An apron is a garment that is typically worn over clothing to protect it from stains or spills, and it often has a sturdy, durable material like canvas or leather, and may have straps or ties to secure it around the waist.",
    "dishwasher": "A dishwasher is a large, rectangular appliance with a door on the front and controls on the top.",
    "guinea pig": "Guinea pigs are small, cute rodents with short legs, a stocky build, and a distinctive round body shape.",
    "seat belt": "A seat belt is a strap that is typically worn across the chest and fastened with a buckle, and it is designed to secure a person in a vehicle during an accident.",
    "Flat-Coated Retriever": "Flat-Coated Retrievers are a medium-sized breed of dog known for their short, flat, and dense coat that is typically golden or cream in color.",
    "West Highland White Terrier": "The West Highland White Terrier, also known as the Westie, is a small, white, and furry dog with a distinctive mustache and beard.",
    "rugby ball": "A rugby ball is typically round in shape with a slightly pointed end and a slightly more rounded end, and it is covered in a pattern of four evenly spaced, thick, white lines that are separated by two thin, red lines.",
    "toilet seat": "A toilet seat is a flat, usually round, piece of material that is placed over the toilet bowl to provide a comfortable and hygienic surface for the user to sit on.",
    "small white butterfly": "A small white butterfly typically has delicate wings with a soft, powdery texture and a pattern of veins that create a subtle, lacy effect.",
    "cardigan": "A cardigan is a type of sweater that is typically characterized by its long sleeves, open front, and button or toggle fastening.",
    "shoe store": "A shoe store typically has a wide variety of shoes on display, with different styles, colors, and sizes to choose from.",
    "maze": "A maze is a complex, interconnected network of paths and passages that often feature winding corridors, dead ends, and multiple levels or floors.",
    "pufferfish": "Pufferfish are small, round fish with a distinctive spiky appearance and large, round eyes.",
    "flute": "A flute is a musical instrument that is typically made of wood or metal and has a long, slender body with a hole in the middle and a mouthpiece at one end.",
    "horse chestnut seed": "A horse chestnut seed is typically round or slightly irregular in shape, with a smooth, shiny surface and a small, pointed top.",
    "broccoli": "Broccoli is a green vegetable with a crown of tightly packed buds and long, thick stems.",
    "suit": "A suit is a type of formal wear that typically consists of a jacket and trousers made from the same fabric, with a collar and lapels, and often features a front fastening such as buttons or a zipper.",
    "black stork": "A black stork is characterized by its large size, long legs, and distinctive white beak.",
    "vine snake": "Vine snakes are small, slender reptiles with long, flexible bodies and smooth, glossy scales.",
    "valley": "A valley is a low-lying area of land that is typically surrounded by hills or mountains, and is often characterized by a wide, open space with a gentle slope towards a central low point.",
    "recreational vehicle": "A recreational vehicle, also known as an RV, is a type of vehicle that is designed for travel and leisure activities. These vehicles are typically equipped with a variety of amenities and features to make them comfortable and convenient for travelers, such as a kitchenette, sleeping quarters, and a bathroom. RVs come in a range of sizes and styles, from small campervans to large motorhomes, and can be towed behind a car or driven on their own. They are often used for road trips and camping adventures, and can provide a convenient and comfortable way to explore new destinations.",
    "gown": "A gown is a long, flowing garment that is typically worn over other clothing and often has a hood or cape attached to it.",
    "Beagle": "Beagles are a small breed of dog known for their short, smooth coats and expressive eyes.",
    "Boston Terrier": "Boston Terriers are a small, non-sporting breed of dog known for their tuxedo-like coat pattern, expressive eyes, and erect ears.",
    "tram": "A tram is a type of public transportation vehicle that runs on tracks and is typically characterized by its long, narrow shape and multiple sets of doors for boarding and alighting passengers.",
    "umbrella": "An umbrella is a handheld device that is typically made of a collapsible canopy supported by a central rod and a handle, and is used to provide protection from rain or sun.",
    "upright piano": "An upright piano is a tall, freestanding musical instrument with a vertical case and a keyboard that is attached to a soundboard and strings.",
    "Carolina anole": "Carolina anoles are small lizards with a distinctive crest on their head and a long, slender tail.",
    "Italian Greyhound": "The Italian Greyhound is a small, slender dog with long legs and a sleek, short coat that comes in a variety of colors including white, gray, black, and brindle.",
    "frying pan": "A frying pan is typically a flat, round, and shallow pan with a handle, used for cooking food on a stovetop.",
    "bolete": "A bolete is a type of mushroom that typically has a round or slightly irregular shape, a cap that is often brown or reddish-brown in color, and a stem that is usually white or yellowish in color.",
    "sunscreen": "A sunscreen typically has a light, even application that dries quickly, leaving a clear, matte finish on the skin.",
    "jaguar": "A jaguar is a large, powerful cat with a distinctive coat pattern of black rosettes on a lighter background, typically orange or yellow.",
    "fox squirrel": "Fox squirrels are characterized by their large size, bushy tails, and distinctive reddish-brown fur with white underbellies.",
    "binoculars": "Binoculars are a type of optical instrument that consists of two telescopes mounted side by side, with a pair of eyepieces positioned in front of each telescope for the user to view through.",
    "feather boa": "A feather boa is a long, slender, and flexible garment made from the plumage of a bird, typically featuring iridescent colors and a metallic sheen.",
    "sunglass": "Sunglasses are a type of eyewear that are designed to protect the eyes from the sun's harmful ultraviolet (UV) rays and to reduce glare. They typically have a frame and lenses made of materials such as plastic or metal, and may have a tint or coating to enhance contrast or reduce blue light. Sunglasses come in a variety of styles, colors, and sizes, and may be worn for fashion as well as function.",
    "football helmet": "A football helmet is a piece of protective gear that covers the head of a player and is typically made of hard plastic with a face mask and a chin strap.",
    "cassette player": "A cassette player is a small, portable device that typically has a rectangular shape with a slot for inserting cassette tapes and a set of buttons or controls for playing and fast-forwarding through the tape.",
    "earth star fungus": "Earth stars, also known as Geastrum, are a type of fungus that has a unique star-shaped appearance with a hollow center.",
    "chickadee": "Chickadees are small, perky birds with distinctive black-capped heads and white cheeks.",
    "hammer": "A hammer is a hand tool that consists of a handle and a head with a flat surface on one end and a spike on the other end.",
    "Egyptian Mau": "The Egyptian Mau is a small, elegant cat with a sleek body, long legs, and large ears.",
    "screw": "A screw is a cylindrical object with a filed or ridged surface that is used to fasten or secure objects together.",
    "partridge": "A partridge is a small bird with a brown and black striped body, a short tail, and a conical-shaped beak.",
    "hornbill": "Hornbills are large, colorful birds with a distinctive curved beak and a casque on top of their head.",
    "Redbone Coonhound": "A Redbone Coonhound is a breed of dog known for its distinctive red coat, floppy ears, and expressive eyes.",
    "smooth green snake": "A smooth green snake typically has a slender body, a glossy green coloration, and may have a pattern of darker green or black scales along its back.",
    "lighter": "A lighter typically has a cylindrical body with a small flame and a ignition mechanism, such as a wheel or a button, to light a flame.",
    "Samoyed": "Samoyeds are a breed of dog known for their thick, double coat of fur, which can be white or cream in color, and their expressive, friendly facial expression.",
    "refrigerator": "A refrigerator is a large, rectangular appliance with a door that is typically made of clear glass or a solid color.",
    "bison": "Bison are large, muscular animals with long, curved horns and a shaggy coat of fur.",
    "assault rifle": "An assault rifle typically has a compact design, a pistol grip, a collapsible stock, and a detachable magazine.",
    "cornet": "A cornet is a brass instrument that has a distinctive shape, with a long, narrow tube that curves back on itself and ends in a flared bell.",
    "Norwegian Elkhound": "The Norwegian Elkhound is a large, muscular dog with a thick, double coat of fur that can be either gray or beige in color.",
    "planetarium": "A planetarium is a large, dark room with a domed ceiling and a projector that displays images of the night sky, allowing visitors to see the stars and constellations as they would appear from different locations on Earth.",
    "Entlebucher Sennenhund": "The Entlebucher Sennenhund is a large, muscular dog with a short, dense coat that is typically tricolored with black, rust, and white markings.",
    "kimono": "A kimono is a traditional Japanese garment that is characterized by its T-shaped design, wide sleeves, and long, wide ties known as \"obi.\"",
    "hot tub": "A hot tub is a large, usually rectangular or oval-shaped container filled with water, designed for soaking and relaxation.",
    "breastplate": "A breastplate is a piece of armor that covers the front torso of a person, typically made of metal and featuring a design that covers the chest and abdomen.",
    "Band-Aid": "A Band-Aid is a small, adhesive bandage that is typically used to cover and protect minor cuts, scrapes, and abrasions.",
    "Irish Water Spaniel": "The Irish Water Spaniel is a large, muscular dog with a distinctive curly coat and a friendly, expressive face.",
    "waffle iron": "A waffle iron is a kitchen appliance with a grid-like pattern on its surface, designed to cook waffles.",
    "barber chair": "A barber chair is a specialized type of seating designed for haircutting and styling, typically featuring a reclining backrest, an adjustable armrest, and a cushioned seat.",
    "car mirror": "A car mirror is a small, convex reflective surface that is typically mounted on the outside of a vehicle to allow the driver to see the area behind and to the sides of the car.",
    "Pickelhaube": "A Pickelhaube is a type of military helmet that is characterized by its spiked, conical shape and ornate decorations.",
    "lemon": "A lemon is a round, yellow fruit with a smooth, thin skin and a bright, juicy interior.",
    "Maltese": "The Maltese is a small, white, long-haired dog with a fox-like expression and large, dark eyes.",
    "megalith": "A megalith is a large stone structure that is typically made of rough, unhewn stones that are carefully arranged to create a solid, sturdy structure.",
    "marmot": "Marmots are typically characterized by their short, stocky build, bushy tails, and thick, furry coats.",
    "English Setter": "English Setters are a breed of dog known for their long, silky coats and distinctive feathering on their ears, chest, back, and tail.",
    "screwdriver": "A screwdriver is a handheld tool with a handle and a shaft with a threaded end that is used for driving screws.",
    "airship": "An airship is a large, elongated aircraft that is filled with gas and has a rigid frame, a keel, and a covering, and is typically equipped with a cockpit, a control car, and gondolas for passengers and crew.",
    "water tower": "A water tower is a tall, cylindrical structure with a large storage tank on top, typically made of metal or concrete, and often featuring a domed or pointed roof.",
    "hamster": "Hamsters are small, furry animals with short tails and large eyes.",
    "pan flute": "A pan flute is a musical instrument that consists of a series of parallel, elongated, and slightly flared tubes that are typically made of wood or bamboo.",
    "shower curtain": "A shower curtain is a piece of plastic or fabric that is used to prevent water from splashing onto the floor while taking a shower.",
    "chain mail": "Chain mail is a type of armor that is made up of interlocking metal rings or links that are woven together to form a flexible, protective covering.",
    "trombone": "The trombone is a brass instrument with a long, cylindrical body and a flared bell at the end.",
    "ground beetle": "Ground beetles are typically small, brown or black in color, and have a robust, oval-shaped body with short antennae and legs.",
    "Papillon": "A Papillon is a small, elegant dog with long, flowing hair and large, expressive eyes.",
    "gorilla": "Gorillas are large, powerful animals with short, curved horns on their heads and a distinctive coat of fur that varies in color from brown to black.",
    "Dobermann": "Dobermanns are a medium-sized breed of dog known for their sleek, muscular build, erect ears, and piercing eyes.",
    "patas monkey": "Patas monkeys are characterized by their long legs, bushy tails, and distinctive facial markings.",
    "beaker": "A beaker is a type of laboratory glassware that is typically cylindrical in shape and has a flat bottom.",
    "water jug": "A water jug typically has a cylindrical shape with a narrow neck and a wide mouth, and is often made of clear glass or plastic.",
    "three-toed sloth": "A three-toed sloth has a distinctive appearance, with a small head, large eyes, and long, curved claws on its three toes.",
    "totem pole": "A totem pole is a tall, narrow wooden structure that is typically carved with intricate designs and often features a variety of animals and other symbols.",
    "French horn": "The French horn is a brass instrument with a distinctive curved shape and a long, coiled tube with a flared bell at the end.",
    "stove": "A stove typically has a large, flat surface with burners or heating elements for cooking, and may also have a hood or ventilation system for removing smoke and fumes.",
    "fire salamander": "The fire salamander is a small, brightly colored amphibian with a distinctive yellow or orange stripe down its back and bright red or orange spots on its body.",
    "plunger": "A plunger is a long, cylindrical tool with a handle and a cup-shaped end that is used to clear clogged drains.",
    "eel": "Eels are long, slender fish with a smooth, scaleless skin that can range in color from brown to gray.",
    "fountain": "A fountain is a decorative outdoor feature that typically includes a basin or pool of water, a pump to circulate the water, and a nozzle or spout through which the water flows.",
    "chain": "A chain is a series of interconnected links that are typically made of metal and have a uniform shape and size.",
    "filing cabinet": "A filing cabinet is a tall, rectangular cabinet with multiple drawers, typically made of wood or metal, and is used for storing and organizing documents and files.",
    "axolotl": "Axolotls are known for their distinctive appearance, which includes a slimy skin, large eyes, and a long, flexible body.",
    "tray": "A tray is a flat, usually rectangular or square-shaped surface with a lip or border around the edges to hold its contents in place.",
    "oboe": "The oboe is a woodwind instrument that has a distinctive elongated shape and a curved, slightly flared bell.",
    "Australian Terrier": "Australian Terriers are small, sturdy dogs with a distinctive double coat and a confident, alert expression.",
    "trimaran": "A trimaran is a type of boat that has three parallel hulls, with a mast and sails supported by a central spine.",
    "Boxer": "Boxers are a breed of dog known for their muscular build, short muzzle, and distinctive facial features.",
    "German Shorthaired Pointer": "A German Shorthaired Pointer is a large, muscular dog with a short, sleek coat and a distinctive liver-colored nose.",
    "monarch butterfly": "Monarch butterflies are known for their distinctive orange and black wings, which feature a unique pattern of veins and scales.",
    "mosquito net": "A mosquito net is a piece of fabric that is designed to keep mosquitoes and other insects away from a person while they sleep.",
    "turnstile": "A turnstile is a device used to control access to a particular area, typically consisting of a rotating mechanism with multiple arms or bars that allow one person at a time to pass through.",
    "grey fox": "A grey fox has a distinctive bushy tail, large pointed ears, and a fluffy coat of fur.",
    "langur": "A langur is a small, agile monkey with a long tail, a bushy tail, and a distinctive black mask on its face.",
    "Ibizan Hound": "The Ibizan Hound is a tall, slender dog with long, droopy ears and a distinctive, curved tail.",
    "otter": "Otters are known for their thick, water-repellent fur, webbed feet, and distinctive tails that they use to swim gracefully through the water.",
    "agaric": "Agarics are a type of fungi that typically have a cap and stem, and can come in a variety of shapes, sizes, and colors.",
    "hyena": "Hyenas are known for their distinctive appearance, which includes a large, powerful build, sharp teeth, and a mane of hair running down their neck and back.",
    "dog sled": "A dog sled is a type of vehicle that is designed to be pulled by one or more dogs, and it typically consists of a sled-shaped platform with a seat or standing area for the driver, and a harness or other attachment system for the dogs.",
    "vending machine": "A vending machine typically has a front panel with a display screen, buttons for selecting products, and a slot for inserting coins or bills.",
    "Scottish Deerhound": "Scottish Deerhounds are known for their long, shaggy coats and their distinctive, elegant appearance.",
    "pool table": "A pool table typically has a rectangular shape with a smooth, green or blue playing surface, surrounded by a wooden frame with pockets at each corner and along the sides.",
    "Cocker Spaniel": "Cocker Spaniels are a medium-sized breed of dog with a short, dense coat that can be either solid-colored or have a combination of colors, such as black and tan or liver and white. They have a distinctive \"mane\" of long, silky hair on their chest and a feathered tail. They have a friendly and expressive face with large, round eyes and a long, floppy ear.",
    "plectrum": "A plectrum is a small, thin, flat piece of material with a slightly curved shape, typically made of plastic or wood, and is used to pluck strings on musical instruments.",
    "Curly-coated Retriever": "A Curly-coated Retriever is a large, muscular dog with a distinctive, curly coat of fur.",
    "electric ray": "Electric rays are known for their distinctive appearance, which includes a slender body, a flat, disk-shaped pectoral fin, and a long, whip-like tail.",
    "spider web": "A spider web is a delicate and intricate structure with a complex network of interconnected strands that form a three-dimensional lattice.",
    "coucal": "The coucal is a large, gray bird with a long tail and a distinctive crest on its head.",
    "black-and-white colobus": "A black-and-white colobus has a distinctive coat of fur with alternating black and white stripes, a bushy tail, and large, expressive eyes.",
    "Alaskan Malamute": "Alaskan Malamutes are a large and powerful breed of dog, known for their thick double coat of fur, which can be either black and white or gray and white in color, and their distinctive facial markings, including a mask-like pattern on their face.",
    "cauliflower": "Cauliflower is a cruciferous vegetable that is characterized by its large, tightly-packed clusters of white or purple florets, which are actually immature flower buds.",
    "vacuum cleaner": "A vacuum cleaner typically has a long, flexible hose and a nozzle attachment for cleaning various surfaces.",
    "grey whale": "Grey whales are known for their distinctive large body, long snout, and rough, patchy skin.",
    "Japanese Chin": "The Japanese Chin is a small, elegant dog with a distinctive appearance characterized by its long, flowing coat, large expressive eyes, and erect ears.",
    "analog clock": "An analog clock typically has a circular face with a minute and hour hand that move around the clock face to indicate the current time.",
    "spatula": "A spatula is a long, flat, and narrow kitchen utensil with a handle on one end and a wide, flat surface on the other.",
    "rotary dial telephone": "A rotary dial telephone is a type of telephone that has a circular dial pad with numbered holes and a central \"0\" button.",
    "lighthouse": "A lighthouse is a tall tower, typically made of stone or brick, with a light on top to aid in maritime navigation.",
    "storage chest": "A storage chest is typically a rectangular or cuboid container with a lid, often made of wood, metal, or plastic, and may feature decorative elements such as handles, hinges, or locks.",
    "Basset Hound": "Basset Hounds are a breed of dog known for their long, droopy ears and sad-looking eyes.",
    "Toy Poodle": "Toy Poodles are a small breed of dog known for their distinctive appearance, which includes a round face, large expressive eyes, and a long, fluffy coat that can be found in a variety of colors.",
    "dunlin": "A dunlin is a small bird with a slender body, long legs, and a distinctive upright tail.",
    "bassoon": "The bassoon is a woodwind instrument with a long, curved body and a distinctive, elongated bell.",
    "bassinet": "A bassinet is a small, enclosed bed that is typically designed for newborn babies and young infants. It often features a canopy and a mattress, and may have a rocking function or a mobile above the mattress to entertain and soothe the baby. Bassinets are usually made of wood or metal and may have a decorative design or a neutral color scheme to match the nursery decor.",
    "poke bonnet": "A poke bonnet is a type of headwear that is characterized by its stiff, cone-shaped crown and wide, flat brim.",
    "dingo": "Dingos are medium-sized canines with a slender body, erect ears, and a bushy tail.",
    "Kuvasz": "The Kuvasz is a large, muscular dog with a distinctive white coat and a bold, alert expression.",
    "eraser": "An eraser is a small, cylindrical object with a rubberized surface that is used to remove pencil marks.",
    "sombrero": "A sombrero is a wide-brimmed hat that is typically made of stiffened felt or straw and has a high, conical crown.",
    "apiary": "An apiary typically consists of multiple honey bee hives, often arranged in a row or a cluster, with beekeepers using smokers and protective gear to tend to the hives and harvest honey.",
    "Lakeland Terrier": "The Lakeland Terrier is a small, sturdy dog with a rectangular body, a short, dense coat, and a distinctive beard and mustache.",
    "limpkin": "The limpkin is a large, long-legged wading bird with a distinctive S-shaped neck and a long, pointed beak.",
    "monastery": "A monastery is a religious community that typically consists of monks or nuns who live a simple and ascetic lifestyle, often in a secluded location such as a forest or on a mountain. Monasteries are known for their distinctive architecture, which often includes large, ornate buildings with intricate designs and decorations. These buildings may feature elements such as domes, arches, and stained glass windows, and may be adorned with religious art and iconography. The overall appearance of a monastery can vary depending on the specific religious tradition it belongs to, but many monasteries feature a combination of simplicity and grandeur that reflects the values and ideals of the religious community that inhabits it.",
    "boathouse": "A boathouse typically has a wooden or metal structure with a roof to protect boats from the elements, and may also have windows and a door for easy access.",
    "overskirt": "An overskirt is a garment that is typically worn over a dress or a petticoat, and it is characterized by its fullness and the way it drapes over the hips and thighs.",
    "traffic light": "A traffic light is a signaling device that uses a set of colored lights (typically red, yellow, and green) to control the flow of traffic at intersections.",
    "lotion": "A lotion is a topical cream or liquid that is typically applied to the skin to moisturize and soothe it. It may have a smooth, creamy texture and a slightly oily or greasy appearance, and may be clear, white, or light-colored. It may also have a mild, pleasant aroma and a slightly oily or greasy feel when applied to the skin.",
    "carved pumpkin": "A carved pumpkin typically has a large, round, and slightly flattened shape with a thick, rough skin that is typically orange or yellow in color.",
    "velvet fabric": "Velvet is a type of fabric that is known for its soft, smooth, and luxurious appearance.",
    "Weimaraner": "Weimaraners are a large breed of dog with a sleek, muscular build, short and smooth coat, and distinctive amber-colored eyes.",
    "rickshaw": "A rickshaw is a small, two-wheeled vehicle with a covered carriage and a driver's seat in the front.",
    "sawmill": "A sawmill is a large industrial facility that is equipped with various machines and equipment for processing logs into lumber.",
    "bath towel": "A bath towel is typically a large, soft, and absorbent towel made of cotton or other synthetic fibers, with a plush texture and a range of colors and patterns to choose from.",
    "sea anemone": "A sea anemone is a type of marine animal that is characterized by its brightly colored, radially symmetrical body and long, slender tentacles.",
    "airplane wing": "The airplane wing is a flat, elongated surface with a curved shape, designed to generate lift and allow the aircraft to fly through the air.",
    "barbershop": "A barbershop typically has a red, white, and blue color scheme, with a chair for haircuts and a mirror for customers to see themselves in.",
    "cassette": "A cassette is a small, rectangular plastic case with a hole in the center and a sliding mechanism to insert and remove the tape.",
    "Affenpinscher": "The Affenpinscher is a small, sturdy dog with a distinctive mustache and beard, a harsh coat, and a confident expression.",
    "Keeshond": "Keeshonds are a small breed of dog with a thick, double coat of fur that is typically gray and black in color, and a distinctive \"mane\" of long, soft hair that stands up on their neck and chest.",
    "military hat (bearskin or shako)": "A military hat, such as a bearskin or shako, typically features a tall, conical crown and a flat, circular brim.",
    "fireboat": "A fireboat is a large, powerful vessel equipped with specialized firefighting equipment and a brightly colored hull to make it easily visible on the water.",
    "siamang": "A siamang is a large, arboreal primate with a distinctive, bushy tail and a long, prehensile tongue.",
    "beach": "A beach is a coastal area characterized by sand, water, and often the presence of vegetation such as grasses or shrubs.",
    "macaw": "Macaws are known for their vibrant plumage, which often includes shades of red, blue, green, and yellow.",
    "clownfish": "Clownfish are small, colorful fish with distinctive black, white, and orange stripes.",
    "Golden Retriever": "Golden Retrievers are known for their friendly expression, warm golden coat, and expressive eyes.",
    "ladybug": "A ladybug is a small, round, brightly colored insect with a distinctive black \"V\" shape on its forehead and a row of black spots down its back.",
    "music speaker": "A music speaker typically has a wooden or plastic enclosure, a speaker cone or dome, a magnet, a voice coil, and a dust cover.",
    "red king crab": "A red king crab has a bright red body with white tips on its legs and claws.",
    "hatchet": "A hatchet is a small, handheld tool with a sharp blade and a handle, typically used for chopping or cutting.",
    "parallel bars": "Parallel bars are a piece of gymnastics equipment that consists of two horizontal bars that are parallel to each other and are typically made of metal.",
    "barn spider": "Barn spiders have a distinctive yellow and black striped pattern on their bodies.",
    "hockey puck": "A hockey puck is a small, round, flat disc with a slightly raised center and a smooth, curved surface.",
    "sock": "A sock is a tube-shaped garment typically made of knitted or woven fabric, with a distinct heel and toe, and often featuring a pattern or color scheme.",
    "Giant Schnauzer": "Giant Schnauzers are a large breed of dog with a distinctive appearance, characterized by their bushy eyebrows, beard, and mustache, as well as their wiry, dense double coat.",
    "lionfish": "Lionfish are known for their distinctive appearance, featuring long, flowing fins and a fan-like tail, along with a unique pattern of vertical stripes that vary in color from red to brown.",
    "dhole": "A dhole is a small, slender canid with short, smooth fur and large, erect ears.",
    "moped": "A moped typically has a small engine, a step-through frame, and a platform for the rider's feet.",
    "bolo tie": "A bolo tie is a type of necktie that is typically made of leather or suede and features a large, decorative knot.",
    "Soft-coated Wheaten Terrier": "Soft-coated Wheaten Terriers are known for their distinctive shaggy, curly coats and expressive, friendly faces.",
    "mobile phone": "A mobile phone typically has a rectangular shape with a touch screen display on the front, a camera on the back, and a row of buttons or a touch-sensitive panel on the side.",
    "coyote": "Coyotes are typically characterized by their slender body, bushy tail, and erect ears.",
    "scarf": "A scarf is a long, narrow piece of fabric that is typically worn around the neck and is often used as a decorative accessory.",
    "menu": "A menu typically consists of a list of food or beverage items, along with their prices, arranged in a visually appealing manner.",
    "nematode": "Nematodes are small, cylindrical worms with a tough, flexible cuticle and a distinct head with two sensory antennae.",
    "black grouse": "A black grouse is a small bird with a black plumage, a white patch on its chest, and a long, curved beak.",
    "perfume": "A perfume has a complex visual appearance, with a colorful and eye-catching bottle design, often adorned with intricate patterns or decorative elements, and a small amount of fragrance oil with a viscous, slightly glossy consistency.",
    "dishcloth": "A dishcloth is a flat, rectangular piece of fabric with a textured surface that is designed for washing and drying dishes.",
    "carbonara": "Carbonara is a type of pasta dish that is characterized by its creamy, slightly chewy texture and its rich, eggy flavor. It is typically made with penne or similar pasta, and is often topped with grated Parmesan cheese and a sprinkle of black pepper. The dish is usually served hot, and is often garnished with a sprig of fresh parsley for added color and flavor.",
    "steam locomotive": "A steam locomotive is a large, powerful machine with a distinctive smokestack, a boiler, and a tender to carry fuel and water.",
    "consomme": "A consomme is a clear, light-colored broth made from the bones and other parts of a chicken or other poultry.",
    "pot pie": "A pot pie is a savory dish that consists of a flaky pastry crust filled with a mixture of meat, vegetables, and a rich, flavorful gravy, all baked until the crust is golden brown and the filling is bubbling hot and steaming.",
    "dragonfly": "Dragonflies are known for their large, colorful wings and long, slender bodies.",
    "jacamar": "A jacamar is a small, colorful bird with a long, curved beak and iridescent feathers.",
    "magnetic compass": "A magnetic compass is a small, round device with a magnetic needle that points towards the north.",
    "great egret": "A great egret is a large wading bird with long legs, a long neck, and a sharp beak.",
    "cougar": "A cougar is a large, sleek feline with a distinctive coat pattern of irregularly-shaped patches that can range in color from orange-brown to gray, separated by lighter-colored fur.",
    "drumstick": "A drumstick is a long, thin, cylindrical object with a slightly tapered end and a knob-like formation at the bottom.",
    "hair spray": "Hair spray typically has a clear or slightly tinted liquid consistency and is dispensed from a pressurized canister.",
    "aircraft carrier": "An aircraft carrier is a large, flat-topped warship designed to carry, deploy, and recover aircraft.",
    "tarantula": "Tarantulas are known for their hairy bodies and long, spindly legs.",
    "letter opener": "A letter opener is a thin, sharp tool with a pointed tip and a handle, used for opening envelopes.",
    "thatched roof": "A thatched roof is typically characterized by its natural, rustic appearance, with a texture and color that blend well with the surrounding environment.",
    "African rock python": "African rock pythons are large, heavy-bodied snakes with a distinctive pattern of large, round, brown spots on a lighter background color.",
    "mortar and pestle": "A mortar and pestle is a kitchen tool that consists of a round, flat base and a heavy, rounded muller used for grinding and crushing ingredients.",
    "hair dryer": "A hair dryer is a small electrical appliance with a motor-driven fan that blows hot air to dry wet hair.",
    "Arctic fox": "The Arctic fox has a thick, double-layered coat of fur that provides insulation against the cold, as well as large, paddle-like paws for walking on snow and ice.",
    "gibbon": "A gibbon is a small, agile ape with long, thin limbs and a distinctive, bushy tail.",
    "amphibious vehicle": "An amphibious vehicle is a type of vehicle that is designed to be able to travel both on land and in water.",
    "shield": "A shield is a flat, typically circular or rectangular object that is used for protection against various types of attacks or projectiles.",
    "arabian camel": "The Arabian camel is known for its distinctive hump, long eyelashes, and bushy eyebrows.",
    "leatherback sea turtle": "A leatherback sea turtle has a large, muscular body with a distinctive leathery shell that is dark grey or black in color.",
    "pillow": "A pillow is a small, cushioned object that is typically round or rectangular in shape and has a soft, padded surface.",
    "computer mouse": "A computer mouse is a small, handheld device with a scroll wheel and buttons on top.",
    "dugong": "Dugongs are large, herbivorous marine mammals with a distinctive spoon-shaped tail and a flexible, prehensile upper lip.",
    "Brittany dog": "Brittany dogs are known for their distinctive white and orange or liver-colored coats, expressive eyes, and agile, athletic build.",
    "projectile": "A projectile is a moving object that is thrown or launched into the air, and it typically has a streamlined shape to reduce air resistance and a pointed or blunt nose to increase stability and accuracy.",
    "pickup truck": "A pickup truck is a type of vehicle that is designed to transport cargo and often has a large, open bed for carrying items.",
    "pencil case": "A pencil case is typically a small, rectangular container with a flat base and a lid, designed to hold writing utensils such as pencils, pens, and markers.",
    "half-track": "A half-track is a type of vehicle that has a set of tracks on one side and wheels on the other, allowing it to traverse a variety of terrains.",
    "Dutch oven": "A Dutch oven is a large, round, heavy pot with a tight-fitting lid and a long handle.",
    "goblet": "A goblet is a type of glassware that is typically used for drinking wine, and it has a stem and a bowl.",
    "parachute": "A parachute is a large, canopy-like structure made of fabric and designed to slow down the descent of a person or object by creating air resistance.",
    "Gordon Setter": "Gordon Setters are a breed of dog known for their long, shaggy coats and distinctive black and tan markings.",
    "eastern hog-nosed snake": "The eastern hog-nosed snake has a distinctive upturned nose and a black and white checkered pattern on its body.",
    "kite (bird of prey)": "A kite, also known as a bird of prey, typically has sharp talons, a hooked beak, and piercing eyes.",
    "macaque": "Macaques are small to medium-sized monkeys with a distinctive short tail, a broad nose, and a relatively short muzzle.",
    "tank": "A tank is a large, armored vehicle with a distinctive shape and a variety of weapons and equipment mounted on it.",
    "eastern diamondback rattlesnake": "The eastern diamondback rattlesnake is a large, venomous snake with a distinctive pattern of diamond-shaped markings on its back.",
    "sea slug": "Sea slugs are typically small, slender creatures with a smooth, slug-like body and a head with a pair of antennae and a mouth.",
    "cowboy hat": "A cowboy hat is a wide-brimmed, high-crowned hat made of stiffened felt or straw, typically with a high, rounded crown and a wide, flat brim.",
    "sturgeon": "Sturgeons are large, elongated fish with a distinctive snout and rows of bony plates along their bodies.",
    "laptop computer": "A laptop computer typically has a thin, lightweight design with a hinged screen that can be folded back on itself, a built-in keyboard, and a touchpad for input.",
    "steel drum": "A steel drum is a large, cylindrical container with a flat bottom and a conical top, typically made of metal and used for storing and transporting liquids or dry goods.",
    "Pomeranian": "Pomeranians are small, fox-like dogs with erect ears, a bushy tail, and a thick double coat of fur.",
    "drilling rig": "A drilling rig is a large, towering structure with a drill pipe that extends vertically into the ground and a control room where the operator can monitor and control the drilling process.",
    "smooth newt": "A smooth newt has a slender body, a broad head with large eyes, and a long tail that it uses for swimming.",
    "yellow garden spider": "The yellow garden spider has a distinctive yellow body with black stripes and a large, round, yellowish-orange abdomen with a black pattern.",
    "thimble": "A thimble is a small, cylindrical, and usually metal object with a narrow opening and a slightly flared top.",
    "jeep": "A jeep is a type of vehicle that is typically characterized by its rugged, sturdy construction and its ability to handle rough terrain.",
    "envelope": "An envelope typically has a rectangular shape with a flap on one side that is sealed with glue or a stamp.",
    "military uniform": "A military uniform typically consists of a camouflage pattern, rank insignia, and various patches representing the soldier's unit and country of origin.",
    "tiger": "A tiger is a large, striped feline with a distinctive orange and black coat.",
    "flatworm": "Flatworms are small, flat, and often have a smooth, slimy surface.",
    "ring-tailed lemur": "A ring-tailed lemur has a bushy tail with a black ring around the end, and a thick, woolly coat of fur.",
    "baseball player": "A baseball player is typically characterized by their athletic build, strong and muscular physique, and well-defined features such as broad shoulders, a chiseled jawline, and piercing eyes.",
    "greenhouse": "A greenhouse is a structure with large windows or glass panels that allow sunlight to enter and provide a controlled environment for plants to grow.",
    "crayfish": "Crayfish are small, freshwater crustaceans with a distinctive appearance, featuring a hard exoskeleton, pincers, and a tail that they use for swimming.",
    "bakery": "A bakery typically has a warm and inviting atmosphere, with a variety of freshly baked goods on display in the window and a cozy interior filled with the sweet aroma of freshly baked bread and pastries.",
    "shoji screen / room divider": "A shoji screen is a traditional Japanese room divider made of thin wooden slats covered with translucent paper, allowing light to filter through while maintaining privacy.",
    "hare": "A hare is a small, long-legged mammal with large, floppy ears and a short, bushy tail.",
    "pipe organ": "A pipe organ is a musical instrument that features a large, complex structure with many pipes of varying sizes and shapes, arranged in rows and mounted in wooden or metal cases.",
    "Irish Wolfhound": "The Irish Wolfhound is a large and muscular dog with a distinctive long and smooth coat that comes in a variety of colors, including gray, brindle, and white.",
    "Airedale Terrier": "Airedale Terriers are known for their distinctive appearance, which includes a long body, erect ears, and a bushy tail.",
    "military aircraft": "Military aircraft are typically characterized by their sleek, aerodynamic design, powerful engines, and advanced avionics systems.",
    "dam": "A dam is a large, sturdy structure typically built across a river or stream to control the flow of water and create a reservoir for various purposes such as flood control, irrigation, and hydroelectric power generation.",
    "birdhouse": "A birdhouse is a small, typically wooden structure with a hole in the front for birds to enter and exit.",
    "rose hip": "A rose hip is a small, round, red or orange fruit that grows on the stem of a rose bush.",
    "pineapple": "A pineapple is a large, spiky fruit with a rough, tough skin and a bright yellow, juicy interior.",
    "grasshopper": "Grasshoppers are known for their long legs, large eyes, and distinctive antennae.",
    "weasel": "A weasel is a small, slender mammal with short legs, a long body, and a bushy tail.",
    "great grey owl": "The great grey owl is a large, majestic bird with a distinctive white plumage and piercing yellow eyes.",
    "chambered nautilus": "A chambered nautilus has a distinctive shell with a series of chambers and a spiral pattern.",
    "tiger shark": "A tiger shark is a large, predatory shark with a distinctive striped pattern on its body.",
    "African wild dog": "African wild dogs are characterized by their large, bushy tails, erect ears, and distinctive black, white, and brown fur pattern.",
    "Afghan Hound": "The Afghan Hound is a tall, slender dog with a long, silky coat and a distinctive topknot on its head.",
    "ocarina": "An ocarina is a small, handheld musical instrument with a distinctive, curved shape and a row of finger holes that allow the player to produce different musical notes by covering and uncovering the holes with their fingers.",
    "mink": "Minks are small, slender, and have a sleek body with short legs and a bushy tail.",
    "paddle": "A paddle is a long, narrow, and flat object with a handle at one end and a blade at the other.",
    "bookstore": "A bookstore typically has aisles filled with shelves of books, a checkout area, and a section for displaying new releases or bestsellers.",
    "window shade": "A window shade is a horizontal covering that is used to control the amount of light that enters a room by being lowered or raised to cover the window.",
    "guillotine": "A guillotine is a large, rectangular device with a long, sharp blade that is used for executing people by decapitation.",
    "zucchini": "Zucchini is a green vegetable that is typically long and slender, with a slightly rough skin and a mild, slightly sweet flavor.",
    "hen of the woods mushroom": "Hen of the woods mushrooms have a distinctive fan-shaped cap and a cream-colored or light brown stem.",
    "fur coat": "A fur coat is a type of garment that is made from the fur of animals, and it typically has a soft, warm, and luxurious appearance.",
    "praying mantis": "A praying mantis is a type of insect that has a long, slender body and large, triangular wings that are typically brown or green in color.",
    "spiral or coil": "A spiral or coil is a three-dimensional shape that consists of a series of circular arcs or loops that are curved and twisted around a central axis.",
    "longhorn beetle": "Longhorn beetles are characterized by their very long antennae and distinctive, often ornate, patterns on their bodies.",
    "Bernese Mountain Dog": "Bernese Mountain Dogs are large, muscular dogs with a distinctive tri-color coat of black, rust, and white.",
    "promontory": "A promontory is a raised area of land that extends out into a body of water, often featuring steep cliffs and dramatic coastal views.",
    "shower cap": "A shower cap is a small, usually round, plastic or vinyl cap that is designed to be worn on the head to keep hair dry during a shower or bath.",
    "teapot": "A teapot typically has a round body, a spout for pouring tea, and a handle for holding it.",
    "water bottle": "A water bottle typically has a cylindrical shape with a narrow neck and a wide mouth, and it is usually made of plastic or glass.",
    "Indian cobra": "Indian cobras are known for their distinctive hoods, which they often spread when threatened or in a display of dominance.",
    "measuring cup": "A measuring cup is a kitchen utensil with a handle and a graduated scale marked in units of measurement, such as cups or milliliters, to measure the volume of liquid or solid ingredients.",
    "Standard Poodle": "A Standard Poodle is a large, elegant dog with a slender build, a long muzzle, and a distinctive topknot of curly hair on its head.",
    "T-shirt": "A T-shirt is a short-sleeved, round-necked garment typically made of lightweight, breathable fabric, and often featuring a design or logo on the front.",
    "lab coat": "A lab coat is typically a white, long-sleeved garment with a front pocket and a hood.",
    "ox": "An ox is a large, muscular animal with a hump on its shoulders, long horns, and a thick, shaggy coat of hair.",
    "sandal": "A sandal is a type of footwear that is typically worn in warm weather and consists of a flat sole that is strapped to the wearer's foot using a thong or laces.",
    "Vizsla": "Vizslas are a medium-sized breed of dog known for their short, smooth coat and distinctive red or golden rust color.",
    "four-poster bed": "A four-poster bed typically features four tall, decorative posts at each corner of the bed frame, with a canopy draped over the top.",
    "pizza": "A pizza typically has a round, flattened base topped with tomato sauce, cheese, and various other ingredients such as meats, vegetables, and herbs.",
    "mushroom": "Mushrooms are typically round or irregularly shaped, with a cap and a stem, and can be found in a variety of colors, including brown, white, and yellow.",
    "catamaran": "A catamaran is a type of boat that has two parallel hulls, a mast, and sails, and is typically used for recreational sailing or racing.",
    "toy store": "A toy store typically has a colorful and vibrant interior, filled with a wide variety of toys and games for children of all ages.",
    "sneaker": "A sneaker is a type of footwear that typically has a flat sole, a laced-up front, and a cushioned interior.",
    "remote control": "A remote control typically has a rectangular shape with a row of buttons and a directional pad on the front.",
    "radiator grille": "A radiator grille is a metal grate that covers the front of the engine and serves as a protective cover for the radiator and other components.",
    "beer bottle": "A beer bottle typically has a glass or plastic bottle with a label on the front and a bottle cap on the top.",
    "corkscrew": "A corkscrew is a handy tool used to remove corks from bottles, featuring a spiral metal rod that is inserted into the cork and then twisted to extract it.",
    "baguette": "A baguette is a long, thin, crusty bread that is typically made from wheat flour and water.",
    "chiton": "Chitons are small, flat, and have a hard, shell-like body that is covered in plates or scales.",
    "bow tie": "A bow tie is a type of headwear that consists of a small, decorative, and typically black or black-colored ribbon that is tied in a bow shape around the neck and rests on the chest.",
    "Windsor tie": "A Windsor tie is characterized by its wide, rectangular shape and bold, symmetrical pattern.",
    "mobile home": "A mobile home is a type of prefabricated housing that is built off-site and then transported to its final location, where it is assembled on a permanent foundation. These homes are typically single-wide or double-wide and feature a variety of exterior and interior design options, including different siding materials, roofing styles, and window configurations. Mobile homes also often have a distinctive layout, with an open floor plan and a focus on functionality and efficiency.",
    "maraca": "A maraca is a musical instrument that is typically round or oval in shape and has a handle, and it is often decorated with patterns or designs.",
    "titi monkey": "Titi monkeys are small, agile primates with long tails, large eyes, and a distinctive white patch on their forehead.",
    "keyboard space bar": "The space bar is a long, rectangular key located at the bottom center of a keyboard.",
    "chain-link fence": "A chain-link fence is a type of fence that is characterized by its interconnected diamond-shaped openings.",
    "pirate ship": "A pirate ship is typically characterized by its large size, colorful and eye-catching design, and the presence of various flags and banners flying from its masts.",
    "hard disk drive": "A hard disk drive is a type of computer storage device that uses magnetic recording to store and retrieve digital information.",
    "graduation cap": "A graduation cap is typically a square, closed cap with a flat square top and a tassel attached to the center.",
    "folding chair": "A folding chair typically has a collapsible frame with a seating area and often includes a carrying case or bag for easy transportation.",
    "Miniature Schnauzer": "Miniature Schnauzers are small dogs with a distinctive mustache and beard, a bushy tail, and a wiry coat that can be found in three different colors.",
    "acorn": "An acorn is a small, round, brown nut with a cap on top.",
    "maillot": "A maillot is a type of swimsuit that features a one-piece design with a fitted torso and legs, often with a scoop neck and low-back design.",
    "dining table": "A dining table typically has a flat surface with a border or frame, and may have legs or a pedestal to support it off the ground.",
    "bell pepper": "Bell peppers are typically large, elongated, and have a bright green color when they are unripe, and a vibrant red, yellow, or orange color when they are ripe.",
    "ocean liner": "An ocean liner is a large, luxurious ship designed for ocean travel, typically featuring multiple decks, a grand staircase, and elegant public spaces.",
    "chocolate syrup": "Chocolate syrup is a thick, smooth, and glossy liquid with a rich, dark color and a slightly shiny appearance.",
    "mixing bowl": "A mixing bowl is typically a round, deep dish with a smooth, curved interior surface and a flat bottom.",
    "ptarmigan": "A ptarmigan is a small bird with a plump body, short legs, and a short tail. It has a round head with a short, straight beak and large, round eyes. The feathers of a ptarmigan are brown and white, with a black patch on the forehead and a white patch on the cheek. The male and female plumage is different, with the male having more vibrant colors.",
    "rock crab": "A rock crab has a hard, round body with a brownish-gray color and long, spindly legs.",
    "Clumber Spaniel": "Clumber Spaniels are a large breed of dog with a distinctive appearance, characterized by their long, droopy ears, expressive eyes, and wrinkled faces.",
    "platypus": "A platypus is a unique and distinctive-looking animal with a flattened body, a broad bill, and a distinctive patch of fur on its head.",
    "duck": "Ducks are typically characterized by their short, stubby tails, webbed feet, and distinctive waddling gait.",
    "beer glass": "A beer glass typically has a tall, slender body with a wide mouth and a stem.",
    "mud turtle": "Mud turtles have a distinctive appearance, with a flat, elongated body and a broad, rounded carapace that is often covered in mud or algae.",
    "Saharan horned viper": "The Saharan horned viper is a large, thick-bodied snake with a distinctive pair of horn-like structures on its head.",
    "fiddler crab": "Fiddler crabs are small, colorful crustaceans with one large claw and one small claw.",
    "Norfolk Terrier": "The Norfolk Terrier is a small, sturdy dog with a distinctive mustache and beard, a wiry coat, and a friendly expression.",
    "crutch": "A crutch is a long, thin, and lightweight walking aid that is typically made of wood or metal and has a curved handle at one end and a rubber tip at the other.",
    "radio": "A radio is a small electronic device that typically has a display screen, a set of buttons or a dial for adjusting settings, and an antenna for receiving signals.",
    "front curtain": "A front curtain is typically a large, heavy drape that is used to cover the front of a stage or a proscenium arch. It is often made of heavy, decorative fabric and is designed to be visually striking and to complement the overall aesthetic of the stage set. The front curtain may be adorned with intricate patterns, colors, or other decorative elements, and it may be used to create a sense of drama or to set the mood for a particular performance. In some cases, the front curtain may also serve a practical purpose, such as providing a backdrop for the stage or helping to absorb sound.",
    "block plane": "A block plane is a small, handheld woodworking tool with a sharp blade and a adjustable depth stop, used for making precise, clean cuts in wood.",
    "impala (antelope)": "The impala is a medium-sized antelope with long legs, a slender body, and a distinctive white and black striped pattern on its fur.",
    "can opener": "A can opener is a small kitchen tool with a sharp blade that is used to open canned goods by cutting around the edge of the can.",
    "station wagon": "A station wagon is a type of vehicle that typically has a large, spacious interior and a rear cargo area that can be accessed through a rear door.",
    "sea urchin": "Sea urchins are typically round in shape with a tough, spiny exterior and a small, pink or purple body.",
    "ring binder": "A ring binder is a type of notebook that has a spine with rings in it, which allows the pages to be held together and easily flipped through.",
    "American coot": "The American coot is a small, plump bird with a distinctive white beak and a black, round head.",
    "torch": "A torch is a handheld light source that typically has a handle, a head with a light bulb or LED, and a battery compartment.",
    "banana": "A banana is a long, curved fruit that is typically yellow when ripe.",
    "yellow lady's slipper": "A yellow lady's slipper typically has a bright yellow, pouch-like flower that hangs from a stalk and is surrounded by large, green leaves.",
    "tiger beetle": "Tiger beetles are small, colorful insects with long legs and a distinctive black and orange striped pattern on their elytra.",
    "face powder": "Face powder is a type of makeup that is used to set a woman's makeup and give her a smooth, matte finish. It is typically applied with a brush or puff and comes in a variety of shades to match a woman's skin tone. Face powder is often used in combination with other makeup products, such as foundation, blush, and eyeshadow, to create a complete makeup look.",
    "African bush elephant": "African bush elephants are known for their large size, long tusks, and wrinkled skin.",
    "box turtle": "Box turtles have a distinctive appearance, with a small, rounded shell that is usually brown or black in color, and a hinged plastron that allows them to close their shells almost completely.",
    "junco": "A junco is a small, gray and white bird with a short, conical beak and a short, square tail.",
    "knot": "A knot is a type of fastener that is used to secure two or more ends of a rope or string together.",
    "diaper": "A diaper is a piece of absorbent cloth that is worn by babies and toddlers to catch their urine and feces.",
    "joystick": "A joystick is a control device that consists of a stick that can be moved in two or more directions and a button or buttons that can be pressed.",
    "baseball": "A baseball is a small, round object with a cork or rubber core, a yarn or string winding, and a tightly-stitched leather exterior.",
    "Alpine ibex": "The Alpine ibex is a large, wild goat with long, curved horns and a thick, shaggy coat of hair.",
    "jigsaw puzzle": "A jigsaw puzzle typically consists of a grid of interlocking pieces with a picture or design on them, which must be assembled to form a complete image.",
    "toilet paper": "A roll of toilet paper typically has a white or light brown color and is made of a soft, absorbent material.",
    "koala": "Koalas are small, furry animals with large, round ears and a distinctive black nose.",
    "Labrador Retriever": "Labrador Retrievers are known for their short, dense, and water-resistant coats, which can be found in three main colors: black, yellow, and chocolate.",
    "home theater": "A home theater typically features a large screen, comfortable seating, and surround sound audio system.",
    "iPod": "An iPod is a small, sleek, and portable electronic device with a touch screen interface and a minimalist design.",
    "scuba diver": "A scuba diver is a person who is equipped with a diving suit, flippers, and a mask and is ready to explore the underwater world.",
    "oystercatcher": "Oystercatchers are large, wading birds with long, sharp beaks and distinctive black and white plumage.",
    "semi-trailer truck": "A semi-trailer truck is a large vehicle that consists of a towing engine and a detachable trailer, with a fifth wheel coupling used to connect the two.",
    "convertible": "A convertible is a type of vehicle that has a folding roof, allowing the driver and passengers to enjoy an open-air driving experience.",
    "hermit crab": "A hermit crab has a small, round body with a hard exoskeleton and a pair of large, claw-like pincers.",
    "conch": "A conch is a large, spiral-shaped shell with a distinctive pink or brown color and a smooth, shiny surface.",
    "zebra": "A zebra is a large, herbivorous mammal with distinctive black and white stripes on its body.",
    "pig": "Pigs are large, round animals with short legs, a stout body, and a distinctive snout.",
    "cottontail rabbit": "Cottontail rabbits are known for their long, fluffy tails and large, expressive eyes.",
    "oxygen mask": "An oxygen mask is a small, lightweight device that covers the nose and mouth and is designed to provide a steady supply of oxygen to the wearer.",
    "tiger cat": "A tiger cat is characterized by its distinctive black and orange stripes, which cover its body and create a unique pattern on each individual.",
    "pier": "A pier is a long, narrow structure that extends out over the water, typically supported by wooden or concrete pillars.",
    "indri": "Indri is a large, grayish-brown lemur with a long, bushy tail and large, pointed ears.",
    "centipede": "Centipedes are typically characterized by their long, slender bodies and numerous legs, which can vary in color from brown to yellowish-green.",
    "pajamas": "Pajamas are typically characterized by their loose-fitting, comfortable design and are often made from soft, warm materials such as cotton or fleece.",
    "Siamese cat": "Siamese cats are known for their sleek, muscular bodies, large ears, almond-shaped blue eyes, and short, silky coats with a fine texture.",
    "stopwatch": "A stopwatch typically has a circular face with a minute and hour hand, and may also have a second hand and a timer function.",
    "tractor": "A tractor is a large, heavy-duty vehicle with a wide, flat front end and a large engine, designed for pulling plows and other farm equipment.",
    "golf cart": "A golf cart is a small, four-wheeled vehicle that is typically used for transporting golfers and their equipment around a golf course.",
    "stethoscope": "A stethoscope is a medical device that is used to listen to sounds within the body, and it typically has a rubber or plastic chestpiece with a diaphragm and a bell attached to a metal tube.",
    "Pembroke Welsh Corgi": "Pembroke Welsh Corgis are a small herding dog breed with short legs, a fox-like face, and a distinctive double coat that can be either red, sable, or black and tan in color.",
    "Cairn Terrier": "Cairn Terriers are small, sturdy dogs with a distinctive, shaggy coat and a confident, alert expression.",
    "palace": "A palace is a grand and majestic building that typically features ornate architecture, intricate detailing, and luxurious decorations.",
    "leaf beetle": "Leaf beetles are small, oval-shaped insects with a hard, protective shell and a distinctive pattern of spots or stripes on their wings.",
    "Chesapeake Bay Retriever": "Chesapeake Bay Retrievers are a large and muscular breed of dog with a distinctive short, dense coat that is usually brown or black in color.",
    "car wheel": "A car wheel is a round, rubber object with a metal hub and spokes that connects to the vehicle's axle and allows the tire to turn.",
    "cherimoya (custard apple)": "A cherimoya is a large, round fruit with a greenish-brown skin that is covered in small, irregular bumps.",
    "mountain bike": "A mountain bike typically has a lightweight frame, knobby tires, and a suspension system to handle rough terrain.",
    "quail": "Quails are small, plump birds with short legs and a distinctive upright tail.",
    "rapeseed": "Rapeseed is a bright yellow flowering plant with long, thin pods and large, showy flowers.",
    "notebook computer": "A notebook computer typically has a thin and lightweight design, with a built-in keyboard and a touchscreen display.",
    "Asian elephant": "Asian elephants are known for their large ears, long trunk, and wrinkled skin.",
    "banded gecko": "Banded geckos are small, nocturnal lizards with large, expressive eyes and a distinctive pattern of alternating light and dark bands on their bodies.",
    "crash helmet": "A crash helmet is a type of protective headgear that is designed to absorb impact and shield the wearer's head from injury in the event of an accident.",
    "geyser": "A geyser is a natural hot spring that erupts water and steam into the air, often creating a spectacular display of geysers and fountains.",
    "soup bowl": "A soup bowl is typically round in shape with a wide, sloping sides and a flat bottom.",
    "slide rule": "A slide rule is a mechanical calculator that consists of a rectangular frame with a series of logarithmic scales and a sliding cursor.",
    "wolf spider": "A wolf spider has a robust body, long legs, and a distinctive stripe pattern on its abdomen.",
    "Cardigan Welsh Corgi": "A Cardigan Welsh Corgi is a small, sturdy dog with a distinctive long tail, erect ears, and a short, dense coat that can be either straight or slightly wavy.",
    "tow truck": "A tow truck is a large vehicle with a flatbed or a hook and chain mechanism for towing other vehicles.",
    "high-speed train": "A high-speed train typically has a sleek, aerodynamic design with a streamlined nose and smooth curves, and it often features large windows for passengers to enjoy the scenery as they travel at high speeds.",
    "rock beauty fish": "A rock beauty fish is a small, colorful fish with a vibrant blue body, orange fins, and a black and white striped pattern on its head.",
    "common redshank": "A common redshank is a medium-sized bird with a long, thin beak and distinctive black and white striped feathers on its head and neck.",
    "butcher shop": "A butcher shop typically has a display case filled with various cuts of meat, along with other products such as sausages and cold cuts.",
    "cabbage": "Cabbage is a cruciferous vegetable that is characterized by its firm, dense head of leaves and its distinctive purple or green color.",
    "cockroach": "Cockroaches are typically brown or black in color, with a flat, oval-shaped body and long antennae.",
    "German Shepherd Dog": "German Shepherd Dogs are known for their distinctive features such as their erect ears, bushy tails, and muscular build.",
    "Dandie Dinmont Terrier": "Dandie Dinmont Terriers are a small breed of dog known for their distinctive appearance, which includes a long body, short legs, and a unique mustache-like facial feature.",
    "Lhasa Apso": "The Lhasa Apso is a small, long-haired dog with a distinctive topknot and a bushy tail.",
    "vase": "A vase is a tall, narrow container with a wide mouth and a narrow neck, typically used for holding and displaying flowers.",
    "Sealyham Terrier": "Sealyham Terriers are small, white dogs with a distinctive, shaggy coat and expressive, dark eyes.",
    "ski": "A ski is a long, narrow, flat surface with a curved tip and a tail, designed for gliding over snow.",
    "abaya": "An abaya is a long, loose garment that is typically worn over a woman's clothing and covers the entire body, including the head and face.",
    "trifle": "A trifle is a layered dessert that typically consists of sponge cake, custard, fruit, and whipped cream.",
    "lawn mower": "A lawn mower is a machine with a set of blades that cut grass and other vegetation.",
    "disc brake": "A disc brake is a type of brake that uses a disc, or rotor, to slow down or stop a vehicle.",
    "grand piano": "A grand piano is a large, freestanding musical instrument with a horizontal keyboard and a vertical, hinged design that allows the keyboard to be raised and lowered.",
    "lynx": "A lynx is a medium-sized wild cat with a short tail, long legs, and tufted ears.",
    "fly": "A fly typically has a small, compact body with a pair of wings and a pair of antennae.",
    "starfish": "A starfish is a marine animal with a distinctive shape, characterized by a central body and five arms radiating outwards.",
    "badger": "A badger is a small, stocky mammal with a distinctive black and white striped face, short legs, and a bushy tail.",
    "Angora rabbit": "Angora rabbits are known for their long, soft, and silky fur, which can come in a variety of colors including white, gray, and brown.",
    "fire screen": "A fire screen is a decorative element that is typically made of metal or wire mesh and is used to cover a fireplace.",
    "bathtub": "A bathtub is a large, usually oval-shaped container that is designed for taking baths or showers.",
    "triceratops": "Triceratops is a large herbivorous dinosaur with a distinctive frill on the back of its head and three horns on its forehead.",
    "drum": "A drum is a cylindrical object with a tightly stretched membrane, typically made of animal hide, that is struck with a drumstick to produce a sound.",
    "cicada": "Cicadas are known for their distinctive large eyes, long antennae, and loud, distinctive songs.",
    "Geoffroy's spider monkey": "Geoffroy's spider monkeys are small, with long, thin limbs and a prehensile tail, and they have a distinctive white mustache and beard.",
    "butternut squash": "Butternut squash is a type of squash that has a distinctive sweet and nutty flavor, and a smooth, slightly rough skin that is typically orange or yellow in color.",
    "Saluki": "The Saluki is a breed of dog that is known for its slender, elegant body and long, silky coat.",
    "Border Terrier": "Border Terriers are small, agile dogs with a distinctive \"otter\" tail, a thick double coat, and expressive eyes.",
    "messenger bag": "A messenger bag typically has a long strap that goes across the body and is worn over one shoulder, with a front pocket for easy access to frequently used items.",
    "spotted salamander": "Spotted salamanders are small, slender amphibians with a distinctive pattern of yellow or gold spots on a black or dark brown background.",
    "sidewinder rattlesnake": "A sidewinder rattlesnake has a slender body, a distinctive ridge down its spine, and a tail that it uses to rattle when it feels threatened.",
    "mousetrap": "A mousetrap typically consists of a wooden or plastic base, a spring-loaded bar or hammer, and a trigger mechanism that is designed to kill or capture mice.",
    "stage": "A stage typically features a large, elevated platform with a flat surface, often adorned with various lighting and set design elements to create the desired atmosphere for a performance.",
    "barrel": "A barrel is a cylindrical container with a flat bottom and a rounded top.",
    "chimpanzee": "Chimpanzees are known for their distinctive black hair, large eyes, and broad, powerful build.",
    "farm plow": "A farm plow is a large, flat, rectangular blade with a sharp edge, typically made of metal, used for breaking up and turning over soil in preparation for planting crops.",
    "hand-held computer": "A hand-held computer typically has a small screen, a touch interface, and a compact design that allows for easy portability.",
    "balloon": "A balloon is a type of inflatable object that is typically round or slightly elongated, with a smooth surface and a single or multiple openings for filling with air or gas.",
    "chiffonier": "A chiffonier is a tall, freestanding wardrobe with a slender silhouette and multiple shelves or compartments for storing clothing and accessories.",
    "giant panda": "Giant pandas are known for their distinctive black and white fur, which covers their bodies and serves as camouflage in the dense bamboo forests where they live.",
    "quill": "A quill is a long, slender, and flexible feather that is often used for writing or drawing.",
    "digital watch": "A digital watch typically has a small rectangular screen, a set of buttons or a touch interface for navigation, and a backlight for easy visibility in low light conditions.",
    "King Charles Spaniel": "A King Charles Spaniel is a small, friendly-looking dog with a round face, large expressive eyes, and a long, silky coat that comes in a variety of colors.",
    "Tibetan Mastiff": "The Tibetan Mastiff is a large, muscular dog with a thick, long coat of fur that can be black, brown, or a combination of both colors.",
    "bottle cap": "A bottle cap is a small, round, usually metal or plastic lid that is used to seal the top of a bottle.",
    "sports car": "A sports car typically has a sleek and aerodynamic body, a powerful engine, and a high-performance suspension system.",
    "volcano": "A volcano is a mountain or hill that has a crater or vent from which molten rock, ash, and gas can erupt.",
    "cheetah": "Cheetahs are known for their distinctive black and white striped coats, which serve as camouflage in the wild.",
    "whiskey jug": "A whiskey jug typically has a narrow neck, a wide body, and a handle for easy pouring.",
    "missile": "A missile is a long, slender, aerodynamic object with a pointed nose and a tail section, typically with fins for stability and control.",
    "beaver": "Beavers are known for their distinctive flat, broad tails and large, webbed feet.",
    "orangutan": "Orangutans are large, red-haired primates with long arms and a distinctive facial profile.",
    "dust jacket": "A dust jacket is a protective cover that is typically made of paper or cloth and features a decorative design on the front and back.",
    "snow leopard": "The snow leopard is a large, muscular cat with a thick, furry coat that is typically white or cream-colored with darker markings on its ears, face, and tail.",
    "Alaskan tundra wolf": "The Alaskan tundra wolf has a thick, double-layered coat of fur that helps it survive in the harsh, cold environment of the Arctic tundra.",
    "tennis ball": "A tennis ball is typically yellow or green in color and has a fuzzy texture.",
    "ballpoint pen": "A ballpoint pen typically has a cylindrical body with a retractable metal point and a clip for attaching it to notebooks or pockets."
  }